
                             {
	"name": "d",
	"size": [
		"M",
		"S"
	],
	"type": {
		"type": "construct",
		"tags": [
			{
				"tag": "tag",
				"prefix": "pre"
			}
		]
	},
	"source": "d",
	"alignment": [
		{
			"alignment": [
				{
					"special": "d"
				}
			]
		},
		{
			"alignment": null
		},
		{
			"alignment": [
				"L",
				"G"
			],
			"chance": 0,
			"note": "d"
		}
	],
	"ac": [
		{
			"ac": 10,
			"from": [
				"natural armor"
			],
			"condition": "when"
		}
	],
	"hp": {
		"formula": "1d8 + 4",
		"average": 4
	},
	"speed": {
		"walk": {
			"number": 30,
			"condition": "when"
		},
		"burrow": {
			"number": 4,
			"condition": "when"
		},
		"climb": {
			"number": 4,
			"condition": "when"
		},
		"fly": {
			"number": 4,
			"condition": "(hover)/when"
		},
		"swim": {
			"number": 4,
			"condition": "when"
		},
		"canHover": true
	},
	"str": 10,
	"dex": 10,
	"con": 10,
	"int": 10,
	"wis": 10,
	"cha": 10,
	"passive": 20,
	"tokenUrl": "https://static.wikia.nocookie.net/nwn/images/e/e2/Aberration_beholder_wizard.jpg/revision/latest?cb=20110607012426",
	"fluff": {
		"entries": [
			"flavor"
		]
	},
	"environment": [
		"arctic",
		"coastal",
		"d",
		"desert",
		"forest",
		"grassland",
		"hill",
		"mountain",
		"swamp",
		"underdark",
		"underwater",
		"urban"
	],
	"group": [
		"d"
	],
	"soundClip": {
		"type": "external",
		"url": "d"
	},
	"dragonCastingColor": "blue",
	"isNpc": true,
	"familiar": true,
	"alias": [
		"d"
	],
	"shortName": true,
	"page": "d",
	"level": 4,
	"cr": {
		"cr": "13",
		"lair": "10"
	},
	"senses": [
		"blindsight 50 ft.",
		"darkvision 56 ft.",
		"tremorsense 56 ft.",
		"truesight 56 ft."
	],
	"senseTags": [
		"B",
		"D",
		"T",
		"U"
	],
	"languages": [
		"Common",
		"Celestial",
		"Elvish"
	],
	"languageTags": [
		"C",
		"CE",
		"E"
	],
	"save": {
		"str": "+5",
		"dex": "+5",
		"con": "+5",
		"int": "+5",
		"wis": "+5",
		"cha": "+5"
	},
	"skill": {
		"acrobatics": "+5",
		"animal handling": "+5",
		"athletics": "+10",
		"arcana": "+10",
		"deception": "+10",
		"survival": "+10",
		"stealth": "+10",
		"insight": "+10",
		"history": "+10",
		"intimidation": "+10",
		"investigation": "+10",
		"medicine": "+10",
		"nature": "+10",
		"perception": "+10",
		"performance": "+10",
		"persuasion": "+10",
		"religion": "+10",
		"sleight of hand": "+10"
	},
	"vulnerable": [
		{
			"vulnerable": [
				"acid",
				{
					"vulnerable": [
						"bludgeoning"
					],
					"preNote": "pre note",
					"note": "post note"
				}
			],
			"preNote": "prenote",
			"note": "post note"
		},
		{
			"vulnerable": [
				"cold"
			]
		}
	],
	"resist": [
		"bludgeoning"
	],
	"immune": [
		"cold"
	],
	"conditionImmune": [
		"stunned"
	],
	"actionHeader": [
		"actions intro"
	],
	"trait": [
		{
			"name": "traitname",
			"entries": [
				"traits"
			]
		},
		{
			"name": "2nd trait",
			"entries": [
				"2ndtrais info"
			]
		},
		{
			"name": "Adhesive",
			"entries": [
				"The d adheres to anything that touches it. A Huge or smaller creature adhered to the mimic is also {@condition grappled} by it (escape {@dc 13}). Ability checks made to escape this grapple have disadvantage."
			]
		}
	],
	"conditionInflict": [
		"grappled"
	],
	"spellcasting": [
		{
			"name": "Spellcasting",
			"headerEntries": [
				"header"
			],
			"footerEntries": [
				"footer"
			],
			"type": "spellcasting"
		}
	],
	"spellcastingTags": [
		"O"
	],
	"action": [
		{
			"name": "action name",
			"entries": [
				"action"
			]
		},
		{
			"name": "sword",
			"entries": [
				"{@atk mw} {@hit 5} to hit, reach 5 ft., one target. {@h}3 ({@damage 1d6}) mele dmg type damage, or 4 ({@damage 1d8}) twohandled dmg type damage if used with both hands, plus 3 ({@damage 1d6}) damage."
			]
		},
		{
			"name": "Dart",
			"entries": [
				"{@atk rw} {@hit +5} to hit, range 20/60 ft., one target. {@h}2 ({@damage 1d4}) piercing damage."
			]
		}
	],
	"miscTags": [
		"MW",
		"RW",
		"THW"
	],
	"damageTags": [
		"P"
	],
	"bonusHeader": [
		"bonus action intro"
	],
	"bonus": [
		{
			"name": "bonus action",
			"entries": [
				"bonus action info"
			]
		}
	],
	"reactionHeader": [
		"reaction intro"
	],
	"reaction": [
		{
			"name": "reaction name",
			"entries": [
				"reaction info"
			]
		}
	],
	"legendaryActions": 3,
	"isNamedCreature": true,
	"legendary": [
		{
			"name": "legendary action name",
			"entries": [
				"legendary action info"
			]
		}
	],
	"legendaryGroup": {
		"name": "Aboleth",
		"source": "MM"
	},
	"damageTagsLegendary": [
		"Y"
	],
	"mythicHeader": [
		"mythic action intro "
	],
	"mythic": [
		{
			"name": "mythic action name",
			"entries": [
				"mythic action info"
			]
		}
	],
	"variant": [
		{
			"name": "variant name",
			"entries": [
				"variants infor"
			],
			"type": "variant"
		}
	]
}






                                {
                                    "type": "image",
                                    "href": {
                                        "type": "internal",
                                        "path": "adventure/SJ-WS/portstarboard.png"
                                    },
                                    "title": "Directions"
                                },
                                {
                                    "type": "image",
                                    "href": {
                                        "type": "internal",
                                        "path": "adventure/SJ-WS/skyrunner_maindeck.png"
                                    },
                                    "title": "Skyrunner Main Deck"
                                },


                                {
                            "type": "image",
                            "href": {
                                "type": "internal",
                                "path": "adventure/SJ-WS/asteroid.jpg"
                            },
                            "title": "The Hive (Outside View)"
                        },




                                                        {
                            "type": "section",
                            "name": "A Look at the Rooms",
                            "entries": [
                                "Each smaller room of the Hive contains one of the ten small eyes of the Sazaur Queen.",
                                "All the smaller rooms are the same size, just over two miles on a side. Since each surface is a \"floor,\" this means that each room offers about 25 square miles of surface area.",
                                "Each room has a unique environment. Given the intensity of magic in each room, the environment may have unpredictable effects on PCs' spells and items. Each room's description lists these effects, if any.",
                                {
                                    "type": "entries",
                                    "name": "The Crystals",
                                    "entries": [
                                        "In each room, the light source and the focus for the room's sympathetic magic is a giant, glowing crystal that hovers in the middle of the room. The crystal is shaped like a decahedron (a ten-sided die, in gaming terms) and measures 50 yards from point to point. The crystals were created by the Arcane.",
                                        "{@b Function:} Each crystal focuses and purifies the sympathetic magic in its room, then relays it to the Queen's Eye in that room. The light is an intentional by-product of the magic. At its strongest intensity, a crystal gives light equivalent to that of the Sun on a bright summer day. Sometimes a crystal may cast a different light; see the individual room descriptions for details.",
                                        "The giant crystals also serve as parts of the Ravager. As shown in Chapters 5 and 6, the Ravager's shape is that of a giant beholder. When the Ravager assembles, the inner sleeve of the tunnel to each room detaches and turns into a giant eyestalk. Each eyestalk grasps the crystal decahedron in its room, and the crystals become the Ravager's ten smaller \"eyes.\" For more information, see the next chapter.",
                                        "{@b Composition:} The crystals are made of what appears to be diamond. TODO: Unusually strong and sturdy, the crystals save as rock crystal on the Item Saving Throws table (DMG, Table 29, p. 39), except that their saving throw vs. Crushing Blows and Falling is 3. A failed saving throw cracks and destroys one of the crystal's ten facets, producing ldl0 x 10 fragments of (apparent) jewel quality.",
                                        "But this clear, gem-like substance has no commercial value; even if PCs could move the gigantic crystals, they turn to glass when removed from the Hive or the Ravager for more than one hour."
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "The Incarnations",
                                    "entries": [
                                        "Each room holds one of the Queen's Eyes. Each eye has a particular beholder power. Each room was designed to augment that power to artefact status (in theory).",
                                        "But in the eight centuries or more since the Ravager destroyed the beholders that created it, the process of making the artefact has gone slightly awry. Each of the smaller eyes has gathered so much magical energy that it has organized itself into a self-aware intellect. These \"Incarnations\" function as obstacles to the PCs in their attempts to defeat the Ravager.",
                                        "Each of the following room descriptions (except the last) features one unique Incarnation that controls its room. This section discusses the features they share in common, and it starts with a brief description of the process of sympathetic magic in the Hive.",
                                        "{@b Sympathetic magic:} This well-known principle of magic maintains that \"like produces like.\" That is, a small effect can produce a larger but similar magical effect.",
                                        "Many of the material components of spells use sympathetic principles. For example, the basic light spell requires a firefly or a bit of phosphorescent moss, both light-generating objects. When harnessed to a magical spell, these small objects produce a much larger magical light, by the principle of sympathetic magic.",
                                        "In the Hive, the master wizards among the Arcane designed and constructed each room to produce powerful sympathetic magic on a colossal scale. Nearly everything in a room was planned to produce a given emotion, frame of mind, or spell-like effect. The room's atmosphere, its \"aura,\" pervaded the room's central crystal. The crystal purified the enchantment created through sympathetic magic, then transmitted it to the room's eye. The eye thus gained the magical aspect of that room's environment.",
                                        "{@b Self-awareness:} Since the Hive's creators did not survive to supervise this process, it has gone awry and created an unforeseen effect: The smaller eyes have gradually evolved intellects of sorts. Each has become an elemental Incarnation of its power: for example, the fear eye has become an embodiment of fear, and it exists only to feed from fear.",
                                        "In this way, the sympathetic magic process perpetuates itself ever more strongly. The original enchantment powers the eye; the eye's Incarnation actively furthers the conditions of the room toward more extreme embodiments of its power; this increases the power of the room's sympathetic magic, creating a vicious circle. Since the eyes came from a beholder (an evil being), their Incarnations are all evil by nature.",
                                        "Each eye's Incarnation has unique spell-like abilities keyed to the eye's original power. The individual room descriptions list these powers, along with details of the Incarnation's particular personality.",
                                        "{@b Abilities:} The Incarnations share several common powers and weaknesses. First, all of them are material beings, and each Queen's Eye is physically incorporated in its Incarnation's body. The Incarnation can be killed, and this destroys the Queen's Eye in that room.",
                                        "On the other hand, each Incarnation can polymorph self freely, in order to more effectively achieve its desired effect of sympathetic magic. However, the Queen's Eye is always obvious and can be attacked, regardless of the form the Incarnation takes.",
                                        "Each Incarnation communicates telepathically, as though wearing a helm of telepathy (DMG, p. 171). The only differences are that this ability cannot be detected magically, and it allows the Incarnation to communicate with any sentient being, ignoring language barriers.",
                                        "{@b Fighting the Incarnations:} In each room, the PCs' task is to find and recognize the Incarnation (sometimes not an easy task), defeat it, and destroy the eye. This may produce a calamity in the room. The individual room descriptions note the effects, if any, of destroying their Incarnations.",
                                        "{@b For saving throws, to hit, etc., treat each Incarnation as a 20th-level wizard}, unless the individual Incarnation description notes otherwise.",
                                        "TODO: attributes for incarnations?"
                                    ]
                                }
                            ]
                        },
                        {
                            "type": "section",
                            "name": "Room 1 - The Central Chamber",
                            "entries": [
                                "This spherical room, about five miles across, is the formation chamber for the Ravager. The great device assembles itself for each mission of destruction, then disassembles itself to distribute its newly-acquired magical energy to the various Queen's Eyes.",
                                "Since this is the biggest and the centrally located room, it is numbered 1 for convenience. Actually, the PCs have already explored some other room before entering this one, probably Room 2 (see its description in this chapter).",
                                {
                                    "type": "image",
                                    "href": {
                                        "type": "internal",
                                        "path": "adventure/SJ-WS/room1.jpg"
                                    },
                                    "title": "The Hive (Room 1)"
                                },
                                {
                                    "type": "entries",
                                    "name": "Entering the Room",
                                    "entries": [
                                        "In staging this entrance, make sure the players have already appreciated the tremendous size of the previous room they have explored. That makes this room's greater size even more stunning.",
                                        "This section assumes the PCs are heading into Room 1 down one of the tunnels described earlier in this chapter. If this is not true, adjust the description accordingly.",
                                        {
                                            "type": "inset",
                                            "name": "Read this aloud as the players head toward the central chamber:",
                                            "entries": [
                                                "Ahead, you see a cloudy grey sky. At least it looks like the sky, and you can make out thin white clouds in front of the grey background. There seems to be sunlight; the air feels warm and smells fresh."
                                            ]
                                        },
                                        {
                                            "type": "inset",
                                            "name": "An illusion? Some kind of inter-dimensional gate? When the PCs actually enter the chamber, read this:",
                                            "entries": [
                                                "You're in a room that makes the last room look tiny. This one is a gigantic sphere. What you thought was grey sky is really the surface of the sphere.",
                                                "You can't tell how big this room is. But there are clouds high overhead, and you see other patches of cloud floating above other parts of the sphere. You can make out lakes and streams above you. The room looks like part of a continent, the way you saw it from space when you left your homeworld.",
                                                "Light comes from a huge white crystal set into the wall of the sphere. No, you look again. The crystal is actually floating in the centre of a large circular hole, like a pupil in the iris of an eye. The hole looks at least a mile wide.",
                                                "Along the inner surface of the sphere you see weird terrain: huge brown slabs of different shapes; gaping circular pits at regular intervals; and open plain filled with silvery grey vegetation of some kind.",
                                                "Some of that vegetation stands nearby. The plants look like tall silver weeds, or the stalks of weeds.",
                                                "Actually, they look dead."
                                            ]
                                        },
                                        "Gravity in this chamber pulls outward. No matter where the PCs stand in the sphere, they always feel they are at the bottom looking up, as though in an enormous fish-bowl.",
                                        "The light source is the Hive's major crystal decahedron, the one attuned to the principal Queen's Eye. The crystal hovers in the passage between this room and Room 12. Because of its position, the sphere's light varies between the intensity of noon (at the opposite end of the sphere) and sunset (near the crystal's passage). For half a mile around the passage itself, the crystal cannot be seen, and its light lends only a twilit dimness to the area.",
                                        "The crystal and the passage are both described in the section for Room 12.",
                                        "The crystal also casts a longer-range version of the beholder's anti-magic ray; its radius is one mile. However, because of the diluting effect of this tremendous range, the anti-magic effect is reduced to that of a {@spell globe of invulnerability} that only blocks magic level 3 or lower. This functions like the power of the primary {@area The Queen's Eyes||Queen's Eye}.",
                                        "The pits are the tunnels to the smaller rooms, as described at the beginning of this chapter. The huge brown slabs are murals that depict the history of the Sazaur, the Queen's Eyes, and the Ravager. The silver stalks are the dead remains of the silver slimes that maintained the asteroid. The dead stalks smell like burnt gunpowder.",
                                        "The slimes are explained later."
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Description",
                                    "entries": [
                                        "The central chamber is just under five miles across. Its 25 murals each measure roughly one mile by one-half mile. Passages to other rooms are 100 yards across; the great passage to Room 12 measures 1.7 miles from side to side and tunnels one-tenth of a mile into that end of the sphere. The crystal that lights the room is 100 yards in diameter.",
                                        "For all its stupendous size, this room is essentially empty-right now. Except for the details which follow and appear on the adventure cover, there is no sign of the Ravager nor any occupants, and there are no random encounters in this room. But why is the air so fresh? Why is the room so clean?",
                                        "{@b The silver slimes:} The answer lies in these odd {@creature silver slime|SJ-WS|fungus-like maintenance monsters}.",
                                        "The amoeboid blobs scavenge the area for all trash and organic material. In their plant-like \"sporangia\" phase they photosynthesise, absorbing the central crystal's light and cleaning the air.",
                                        "Now that nothing has occupied the central sphere for a long time, most of the silver slimes have died in this room. Their only remains are the stalks that the PCs find between the murals. Living colonies still survive in the smaller rooms. This only adds to the mystery facing the PCs.",
                                        "Many slimes survive in this chamber in their long-lived \"macrocyst\" stage. The DM can introduce these as desired; they become important in the adventure's last chapter. For more information, see the monster description in the appendix.",
                                        "{@b The murals:} The beholders carved these with their disintegration rays, as part of the magical rituals involved in the creation of the Hive. The huge stone panels show scenes from the history of the Sazaur and the Hive. The murals are so large that PCs can't discern their details except from across the chamber. The module cover describes procedures for examining the murals.",
                                        "In fact, these murals are really the armour plating of the Ravager's central sphere. When the weapon is assembled, the function of the murals becomes clear; see Chapter 5."
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Viewing the Murals",
                                    "entries": [
                                        "To view a stone panel that is up to one mile tall and one-half mile wide, the PCs must move to a distant vantage point: at least the centre of the chamber, and probably at the far side. If the PCs are afoot, they can view a mural only from the opposite area of the chamber.",
                                        "This becomes important in two circumstances. First, the PCs' previous adventures may have left potential adversaries in some part of the central chamber, perhaps enemies who have followed them out of the smaller rooms. Or the DM may wish to introduce a random encounter in the central sphere. The quest to view a particular panel may draw the PCs within range of this enemy.",
                                        "Second, the gigantic minor globe crystal floats in the passage between this chamber and Room 12. The crystal's area of effect does not reach far into the central sphere. But if the PCs want to view the murals on the far end of the sphere from that passage, they must sail or travel within range of the crystal's magic-neutralizing area. Its ill effects on a spelljamming ship are described elsewhere in this module.",
                                        "The PCs can see the murals. Can they make sense of them?",
                                        "{@b The murals' style:} These are artworks of an alien species. Try to convey the alien quality in the descriptions of these murals. Works from foreign human cultures can serve as examples. For instance, when describing the murals, consider showing the players Mayan hieroglyphics or rongo-rongo script from Easter Island. A good encyclopaedia offers many such \"alien\" works.",
                                        "There are some features of the Sazaur mural style that are standard regardless of the approach taken:",
                                        {
                                            "type": "list",
                                            "items": [
                                                "All the murals are carved in very high relief. From close up, the murals look like ranges of hills cut with odd channels and box canyons.",
                                                "All the figures depicted look odd to human eyes, as though the artists tried to show not just the front of each figure, but part of the back as well. A beholder perceives more than the conventional 180-degree view of an object facing it: with its wide-set eyestalks, it sees perhaps 190 or 200 degrees of nearby objects. For humanoids, it would be like viewing an object from one position, shifting over five feet to a new perspective, and then combining them into one view.",
                                                "The Sazaur beholders used 11 arbitrary symbols to represent the different powers of their eyes, in the same way we use symbols for natural phenomena (for example, lightning is often depicted as a jagged line). Each symbol starts at a beholder's eye and leads to a target (usually another beholder)."
                                            ]
                                        },
                                        "When they first see the murals, the PCs do not know which of the ten symbols represent which powers. However, each of the 11 symbols is carved in one of the tunnels leading out of the central chamber. The tunnel's symbol shows the power of the room it leads to; for example the symbol for \"slow\" appears in the tunnel leading to Room 9, the embodiment of the beholders' slow power.",
                                        "As they journey through the rooms, sharp players can eventually figure out the meanings of the symbols. This is unimportant in understanding the murals, but it can be useful in the final battle inside the Ravager (see Chapter 6).",
                                        "The symbols:",
                                        {
                                            "type": "list",
                                            "items": [
                                                "{@i Charm person:} a row of circles",
                                                "{@i Charm monster:} a row of linked circles. For both charm symbols, the target is shown within a circle.",
                                                "{@i Sleep:} a thick, wavy line. The target is shows rotated 90 degrees from normal.",
                                                "{@i Telekinesis:} a procession of thin, vertical bars. The target is shown with the bars radiating from it, like rays from a star",
                                                "{@i Flesh to stone ray:} a line of bizarre alphabetic characters that resemble some exotic human alphabet of the DM's choice, such as Tamil or Glagolitic. The characters represent the Sazaur word for \"unmoving.\"",
                                                "{@i Disintegrate:} a thin, dotted line. The target is shown within a dotted circle.",
                                                "{@i Fear:} a row of abstract eyes, pupils within circles. The target's eyes are shown enlarged, or eyes are added if the target lacks them.",
                                                "{@i Slow:} a line of half-circles facing left. The target is shown as a hollow outline.",
                                                "{@i Cause serious wounds:} a line of half-circles facing right. The target is shown as a silhouette. Play up the possibilities of confusion with the slow symbol!",
                                                "{@i Death:} a straight line ending in an empty circle (where the target was).",
                                                "{@i Anti-magic:} jagged, parallel lines. This is the only symbol players can easily figure out, since the murals always depict the lines emerging from a beholder's central eye."
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "What the Murals Show",
                                    "entries": [
                                        "There are five sets of murals, each with five pictures. Each set occupies a row around one \"latitude\" of the central sphere. Consider the large passageway to Room 12 as a \"north pole.\" The sequences are given in order proceeding from that pole toward the opposite end of the sphere.",
                                        "PCs who succeed in Intelligence checks or players who ask the right questions can deduce clues to the Ravager's origin and purpose. The specific clues are left to the DM's discretion; this section tells what the murals show, indicates what the pictures mean, and offers a few suggestions for clues.",
                                        "{@b The murals' shapes:} These vary according to the location on the interior of the sphere. Next to its \"poles,\" they are roughly triangular; at the equator, the murals are rectangles; in between, they are trapezoidal.",
                                        "The difference relates to the murals' true function as the armour plates of the Ravager. Pose the various shapes of the murals as a mystery for the PCs. They learn the reason for the varying shapes when the Ravager assembles.",
                                        "Following is what the murals depict. In this list, they are numbered clockwise from an arbitrary longitude extending from the Room 12 passage to the opposite end of the sphere, and passing Rooms 3 and 9.",
                                        "{@b The first sequence:} This describes the history of the great Hive Mother, or Queen, who led the Sazaur to supremacy. These five murals are equilateral triangles pointing toward the central passage to Room 12.",
                                        "Mural 1. The enormous Queen, with twin rows of five eyestalks around its spherical body (like the layout of rooms in the Hive). Around the Queen is a symmetrical array of many small, irregular spheres, and another sphere is emerging from the Queen's mouth. These are beholder eggs.",
                                        "2. Identical to 1, except that the Queen is now surrounded by many smaller beholders. All of them look exactly alike. These are the offspring of the eggs the Queen laid in the first mural.",
                                        "3-4. The Queen is attacking hordes of small enemy beholders, whose eyestalks all grow from the tops of their heads. Symbols for the various beholder powers radiate from each of the Queen's eyes, and the targets are symbolically represented as described in the previous section (silhouettes, vanished, etc).",
                                        "5. A symbolic representation of the Queen and the Sazaur in triumph. They float in the upper half of the mural. Beneath a thick, double line, the lower half depicts many dismembered beholders of the rival nations.",
                                        "{@b The second sequence:} This sequence depicts the death of the Queen. These murals are trapezoidal, their short upper sides facing the passage to Room 12.",
                                        "Each of these murals has a hole in its centre that measures 100 yards across. These holes remain mysterious until Chapter 5.",
                                        "1. The Queen lying on its side, eyes closed. Behind it, a field of tally marks: A 10x10 array of squares, each square comprising a 3x3 array of 9 tally marks. This represents the Queen's death by natural causes after 900 years (a long life for a beholder, though not uncommon).",
                                        "2. A small group of Sazaur beholders surrounded by many large enemy beholders casting power symbols at them. The Sazaur without their Queen, the mural seems to say, are defenceless.",
                                        "3. The Queen on its side, eyes now blank circles, with a row of 11 eyes above it. Above these eyes are the Sazaur beholders in an array of rows and columns. (The Sazaur have removed the Queen's Eyes for their rituals.)",
                                        "4. The beholders, carved very small on this mural, arranged in a \"circle of circles\"; that is, ten beholders are grouped in a small circle; ten of these circles lie on the circumference of a larger circle; and ten of these larger circles form a still larger circle.In the centre of this largest circle are the 11 Queen's Eyes.",
                                        "This shows the rituals that the Sazaur enacted to turn the eyes into relics. Their ceremonial area actually embraced a still larger order of circles, as shown in Room 12's description. But this largest circle would not fit on the mural!",
                                        "5. The 11 Queen's Eyes, now floating freely with their various power symbols radiating from them, as in murals 3-4 of the first sequence. In the background, the Sazaur beholders watch. (The eyes have become relics.)",
                                        "{@b The third sequence:} This sequence depicts the construction of the Hive. These murals are perfectly rectangular, though curved inward due to the curvature of the sphere.",
                                        "1. A rough, ordinary looking asteroid surrounded by beholder Tyrant Ships.",
                                        "2. To the left are the Sazaur beholders with a grotesque, caricatured Arcane wizard (for the Arcane's appearance, see the boxed campaign set). To the right are many beholders focusing their disintegration rays (thin dotted lines) against a rough arc representing the surface of the asteroid.",
                                        "3. A circle surrounded by a geometric array of 11 squares and a semicircle, all within the rough arc of the asteroid. Of course, these are the rooms of the Hive. But the mural's layout need not bear a resemblance to the actual layout.",
                                        "4. The dome of the asteroid, shown as a great eye with its lids slightly parted. Inside are an iris and pupil, symbolizing the central Queen's Eye that will be placed in Room 12.",
                                        "5. Enemy beholders fleeing the asteroid, which is now shown with the dome eye. From the asteroid radiate many symbols, indicating the defences that, until recently, protected the Hive from attack.",
                                        "{@b The fourth sequence:} This sequence depicts the placement of the smaller eyes in their own rooms. The rooms' sympathetic magic is indicated symbolically. This entire sequence should bewilder the PCs until they have explored one or two of the smaller rooms.",
                                        "Like the murals of the second sequence, these are trapezoidal, but their short sides point away from the passage to Room 12. Also like those of the second sequence, each of these has a 100-yard-wide hole in its centre.",
                                        "Each mural shows two large squares (except for the last, which shows three). Inside each square is a beholder eye and one of the power symbols described in the previous section. For example, the first mural shows two large squares. Inside the first is a beholder eye and a charm person symbol, a row of circles around the eye. Inside the second is an eye surrounded by linked circles, the charm monster symbol.",
                                        "{@b The fifth sequence:} Though PCs should not figure this out, this sequence depicts the construction of the Ravager. Compounding the enigma is the depiction of the Ravager in the same way the first mural sequence depicted the Queen. These murals, like the first sequence, are triangular, but their apexes point away from the passage to Room 12.",
                                        "1. The Queen (or so it appears) is depicted, larger than the surrounding array of beholders. The Queen (actually the Ravager) is shown without eyes; the central eye and the ends of the eyestalks are blank.",
                                        "2. The 11 Queen's Eyes, one large and ten small, are lined up parallel to a line of 11 mandalas, one large and ten small. In the centre of each mandala is a five-pointed design like that of a ten-sided die seen point-on.",
                                        "In fact, each mandala represents a crystal in the smaller Hive rooms. The mandala design arises from the perceptions of the beholders, who see the ten-sided crystals from several angles at once. This mural equates the Queen's Eyes with their governing crystals.",
                                        "3. The \"Queen\" from the first mural in this sequence, but with the mandala designs substituting for eyes. (The crystals are implanted in the Ravager shell.)",
                                        "4. The \"Queen\" next to a large circle with continental outlines sketched in: a world in space. Various power symbols emanate from the mandalas.",
                                        "5.The \"Queen\" as before, but the world is now drawn as a blank circle surrounded by a dotted line. Alert players will remember that in the first mural sequence, this represented death",
                                        {
                                            "type": "image",
                                            "href": {
                                                "type": "internal",
                                                "path": "adventure/SJ-WS/murals.png"
                                            },
                                            "title": "The Hive - Murals"
                                        }
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Staging Hints",
                                    "entries": [
                                        "At all times, try to emphasize the Hive and this chamber in particular as the product of an alien culture. The Sazaur held different values from the PCs and used different symbols in their culture. Properly emphasized, this produces both mystery and tension during the adventure. In this way, the trip through the Hive becomes more than a giant-sized dungeon crawl, and the Ravager becomes a more believable menace in the next chapter."
                                    ]
                                }
                            ]
                        },
                        {
                            "type": "section",
                            "name": "Room 2 - A Charmed Life",
                            "entries": [
                                "This room is the domain of the Queen's Eye Incarnation embodying the beholder's charm person power. This is the first room of the Hive that the PCs visit after the antechamber in the last chapter. This room introduces the PCs to the Incarnations and the interior construction of the Hive.",
                                {
                                    "type": "entries",
                                    "name": "Entering the Room",
                                    "entries": [
                                        "The entrance from the chamber of the Arcane opens on this huge chamber, the first of its kind that the players will encounter. A permanent illusion spell hides this entrance from the room's natives and from the PCs once they are inside.",
                                        {
                                            "type": "inset",
                                            "name": "Read this to the players:",
                                            "entries": [
                                                "The great doors open to reveal a vast expanse. As you move forward, your vessel pivots forward so it rises through the frame that surrounds it. Before your eyes, the doorway fades out of existence, giving way to lush green vegetation.",
                                                "Although you expected another room, it seems you have entered another world, You see a forest and a range of rolling hills. But at the horizon, the sky is the same colour green as the hills. And there are lines rising in the sky, and-",
                                                "-And then you realize you're looking at a wall. It's miles away, miles tall and wide, and covered with forests. And there are others like it all around you. You're in the biggest room you've ever seen, bigger than you can comprehend.",
                                                "Looking up, the first thing you see is a huge crystal, hovering in the sky, as bright as the sun. Above this, where you might have expected to see blue skies, you see yet another green wall. This is a cube of titanic proportions, miles on a side, with the crystal at its centre."
                                            ]
                                        },
                                        "The crystal periodically brightens and dims in a day-night cycle. It also radiates a special anti-magical effect that negates any magic used to resist charm effects. A wall of force protects the crystal."
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Exploring the Room",
                                    "entries": [
                                        "This room is a beautiful tree-filled realm. Music plays everywhere, but it is impossible to determine its origin. The tune is light and lilting, and apparently played on many lutes. Pleasant herbal smells drift on the breeze, accompanied by another unrecognisable odour. In time, the PCs identify the sweet fragrance of the lotus flower.",
                                        "From their spelljamming ship, the PCs see only the trees that cover all sides of this room. The only clearing, that of the Monolith, marks the exit. The Monolith is described below.",
                                        "The PCs probably land and explore on foot. Soon, they meet the room's natives, also described below.",
                                        "{@b Charming:} Magic permeates this charmed realm. When the PCs begin their journey, make a secret saving throw vs. spell for each character. Those who fail succumb at once to a charm person spell that drains their will, leaving them susceptible to anyone who cares to command them. The NPC crewmen succumb automatically.",
                                        "Those who successfully save delay this effect 10 minutes for every point by which the save was made. For instance, making the save by three resists the charm for one-half hour. If a character plugs his ears, he can resist the charm. Plugging the ears of someone who has already succumbed has no effect.",
                                        "Exploration reveals a beautiful forest with flora and fauna from many worlds. Describe creatures from the PCs' homeworld, but change important details: Tiny wolves, pink frogs, giraffes with short necks, and furry purple lizards are all good examples.",
                                        "A huge variety of alien plants bear flowers or fruit. Smelling the flowers or eating the fruit requires an immediate save vs. spell. Failure means that the character is charmed.",
                                        {
                                            "type": "entries",
                                            "name": "Slaves of Peace",
                                            "entries": [
                                                "The natives of this room are the descendants of slaves, humans from a distant crystal sphere who were captured by the Sazaur to help build the Hive. Now their descendants are fair-haired, golden-skinned, diminutive folk who call themselves the Anari. They wear loose silken robes of white and gold.",
                                                "These idle people dance lazily, sing, and tell stories about a \"Crystal-Eating Serpent\" that comes out of the Monolith and \"takes the light away.\" These stories parallel the \"Snake That Eats the Sun\" legend in Room 8 of the Hive. PCs can solve this mystery when the Ravager forms.",
                                                "The charm has left the Anari simple-minded, scatterbrained, and useless. They babble endlessly about the trees and the music and what a nice day it is. When asked about their robes or the ever-present music, the Anari say that the \"Lord of the Dance\" provides all. They don't know where to find him and can't remember what he looks like. Charmed PCs find the Anari fascinating and feel compelled to dance and sing as they do."
                                            ]
                                        },
                                        {
                                            "type": "entries",
                                            "name": "The Monolith",
                                            "entries": [
                                                "Directly opposite the secret door through which the PCs entered the room is a huge, black monolith. This is actually the tunnel sleeve that leads to the rest of the Hive: an enormous five-sided pillar, 100 yards across, standing just over 500 yards tall. At the top, it narrows to a hole 50 yards wide.",
                                                "On closer examination, the monolith appears to be crafted of smooth, unweathered basalt. The opening at the lip, to the tunnel beyond, is large enough for the Skyrunner to pass through easily. See the map for a description of the Hive's tunnels.",
                                                "At the base of the monolith is a Sentinel suit. (See appendix for details.) Like all the Sazaur armour suits, it is currently empty. This particular suit has corroded and is covered in moss and vines. Draw attention to this suit when the PCs first investigate the Monolith. When the PCs leave the room, it will be gone; see below."
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Lord of the Dance",
                                    "entries": [
                                        "When the PCs have all fallen under his spell, Horan, the Incarnation of the charm eye, appears.",
                                        {
                                            "type": "inset",
                                            "name": "Read this to the players:",
                                            "entries": [
                                                "A golden light just ahead grows brighter and brighter, until you can't look directly into it. There is a flash, and the light fades, leaving an amber glow that settles all around you. It surrounds you with a glittering aura.",
                                                "It also surrounds a tall, handsome man in white robes lined with gold. You feel that this man is the closest friend you have in your world or any other. He smiles angelically and opens his upper robe, above the belt. Embedded in his pale chest is a huge, red, withered eye."
                                            ]
                                        },
                                        "This is Horan. Now that the PCs arc under his power, he tells them what he wants:",
                                        {
                                            "type": "inset",
                                            "name": "Read this to the players:",
                                            "entries": [
                                                "\"I am Horan, Lord of the Dance, foremost of the incarnations. When my creators passed, I awakened. Rejoice, for I have chosen you to serve me in the greatest of tasks.",
                                                "\"Go forth into the world beyond, and find the nine other eyes. Bring them here, and they too shall dance to my song. With your assistance, I shall fulfil my glorious destiny and bring order to the universe!\""
                                            ]
                                        },
                                        "Horan can answer general questions about the Incarnations, but he doesn't know their exact identities or powers or the details of the rooms in which they reside. Then Horan sends the PCs forth to do his bidding. He remains in the clearing until his servants return."
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "The Incarnation",
                                    "entries": [
                                        "TODO:",
                                        "Horan: AC 5; MV 12; HD 9; hp 45; #AT 1; Dmg 1-8;SA see below; SD see below; AL LE; THACO 11.",
                                        "{@b Appearance:} The Lord of the Dance is a handsome man, of light build and narrow features. Long golden tresses frame an aristocratic face. His blue eyes are clear and gleam with an inner light. His regal bearing and graceful movements are those of a confident nobleman.",
                                        "His robes, luxurious white silk and gold-embroidered velvet, act as magical armour, protecting him like chainmail. Under Horan's robes, embedded over his heart, lies the Queen's Eye. A narrow, silver blade hangs from one hip in a gem-studded scabbard.",
                                        "{@b Personality:} Horan is a charismatic leader; not a bad sort, as long as everyone treats him as lord and master.",
                                        "{@b Motivation:} A megalomaniac, Horan has never encountered any person he could not control. He is instinctively aware of the other Incarnations and assumes he can rule them as well. Unfortunately, he and the Anari can't leave the room to find them, so he plans to send someone to lure the other lords into his grasp.",
                                        "{@b Powers:} Horan can use these spells three times a day: charm person, command word, and suggestion. He can use the following once per day: mass charm, domination, and mass suggestion. These work only on humanoid targets. Horan himself is immune to all charm effects.",
                                        "One of Horan's primary powers is the ability to teleport without error effortlessly, anywhere in his forest. Doing this requires a full turn, however, so if the PCs surprise him, they have ten rounds to fight him before he can get away.",
                                        "In hand-to-hand combat, Horan uses his sword and any one of his spell-like abilities every round. He can fight while preparing to teleport.",
                                        "{@b Identifying Quote:} \"Charmed, I'm sure.\""
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Leaving the Room",
                                    "entries": [
                                        "When the PCs are ready to leave, most likely under Horan's influence, they return to the Monolith and notice that the Sentinel suit is missing. A pile of vines and moss lie where it stood, but no tracks lead away. (Tobart, using his fly spell, lifted it to the lip of the tunnel, then assumed his true form and entered the armour. The PCs meet Tobart in the suit in Chapter 5.)",
                                        "As soon as the PCs enter the tunnel, the charm spell is broken: Horan's powers don't extend beyond his domain. Clever PCs can sneak back in and ambush Horan. The self-styled overlord is overconfident; he never thinks his servants could resist his divine imperative, so he is unprepared for their return.",
                                        "If they destroy Horan, his Queen's Eye withers and dissolves. The Anari, free of his spell, continue to live in the room, but they can now achieve true happiness rather than lassitude. A few may join the PCs, but they lack useful skills or powers."
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Troubleshooting",
                                    "entries": [
                                        "{@b PCs aren't charmed:} Horan eventually attacks by surprise with mass charm. If he cannot charm all the PCs on the first round, he tries to escape, using the Anari as human shields to interfere with the PCs' return attacks.",
                                        "{@b PCs don't notice the Sentinel:} Restage the same encounter in another room. First, establish the Sentinel, then note later that it has disappeared."
                                    ]
                                }
                            ]
                        },
                        {
                            "type": "section",
                            "name": "Room 3 - Of all the Wild Beasts",
                            "entries": [
                                "This room is the domain of the Queen's Eye Incarnation representing the beholder's charm monster power.",
                                {
                                    "type": "entries",
                                    "name": "Background",
                                    "entries": [
                                        "The Sazaur beholders built this room to help replenish the air supply of the Hive, turning it into a miniature tropical rain forest. Because a forest withers without animal life, the Sazaur stocked this room with a variety of animals. Finally, to keep the flora and fauna in check, and to further the power of the artefact, they used this room to house the charm monster Queen's Eye.",
                                        "After the death of the Sazaur nation, the Queen's Eye developed into an incarnation known as the Beastmaster, lord of this jungle domain. The Beastmaster personifies many of the features of the creatures he controls, in particular, the whimsical and contentious nature of animals."
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Entering the ROom",
                                    "entries": [
                                        {
                                            "type": "inset",
                                            "name": "Read this to the players",
                                            "entries": [
                                                "You emerge from the tunnel, and the temperature jumps about 10 degrees. The air feels as humid as if you were in a swamp. Instantly you begin to perspire. Within moments, your armour grows so uncomfortable that you wish you could remove it.",
                                                "You hear a deafening clamour of animal roars and the screeches of birds.",
                                                "Before you stands a huge figure in bronze armour."
                                            ]
                                        },
                                        "This is a Sentinel (see the appendix for its description). The PCs should quickly see (if they don't fire at once), that the suit stands empty, silent, lifeless. Its metallic skin is covered with moss and green oxidation.",
                                        "Visibility is just a few feet at the entrance. The room is steaming with humidity. Birds squawk and screech; animals bellow, trumpet, and howl; monsters scream and moan. This room teems with life. The PCs can barely make out the sound of a waterfall somewhere in the distance. The noise is deafening, forcing the PCs to communicate by shouting.",
                                        {
                                            "type": "inset",
                                            "name": "When the PCs venture farther, read this aloud:",
                                            "entries": [
                                                "Moving onward, you can make out the other walls of the room. The far wall must be two miles away! Inside the room is a primeval jungle. From all six walls, trees grow hundreds of feet high. A river winds through the jungle, somehow turning the corners at the edges of the cubic room.",
                                                "At the centre of each wall of this room stands a large building. From here, they look like amphitheatres. The largest building stands on the wall opposite the entrance.",
                                                "In the far corner of the vast chamber, you see a colossal waterfall, cascading into a moat that completely encircles the largest building. What magic allows water to fall from the floor of one wall to the floor of another? Which way is up?"
                                            ]
                                        },
                                        {
                                            "type": "entries",
                                            "name": "Details of These Sights",
                                            "entries": [
                                                "{@b The waterfall:} The river is part of the room's irrigation system. The waterfall, caused by a permanent telekinesis effect, speeds up the river, keeping it fresh and flowing.",
                                                "Though the jungle is hot, the water of the falls is bitterly cold. Steam obscures vision in the vicinity of the falls. In addition, the land around the waterfall is rocky and slick. PCs who enter the area must make a Dexterity check. Failure means the PC slipped into the icy cold water. Anyone who falls in is swept into the moat, which is filled with deadly creatures.",
                                                "{@b The buildings:} These are the arenas of the Beastmaster. In these five arenas, he pits creature against creature for his own amusement. On occasion, as the PCs probably learn, he even takes part in the fun himself.",
                                                "The beasts willingly fight for him, since he has charmed virtually every creature in the room. By this exercise of the magic, the Master maintains the sympathetic magic that strengthens him."
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Incarnation",
                                    "entries": [
                                        "TODO:",
                                        "The Beastmaster: AC 018; MV 12; HD 12; hp 90; #AT 2; Dmg 2-12/2-12; SA see below; S D see below; THACO 9; AL LE.",
                                        "{@b Appearance:} The Beastmaster is over six feet tall and hugely muscled, a fact he makes no effort to conceal: he wears only a loincloth and a large amulet affixed to his chest. The amulet contains the beholder's eye, which has grown roots deep in the Master's chest.",
                                        "The Beastmaster's face is florid, his expression constantly changing, mirroring an emotional makeup that could generously be called \"unpredictable.\" His smile is innocent and infectious, but rarely lasts more than a moment. The expression that replaces it could be terrible rage or utter indifference.",
                                        "His face is framed by unruly black hair. In fact, his entire body is covered with hair. Is this man or beast?",
                                        "{@b Personality:} The Beastmaster is completely animalistic and as unpredictable as a kitten. His mood swings are awesome and terrifying. Players who think they've figured him out and befriended him learn (the hard way) that they're wrong. The Beastmaster is not easily read or manipulated.",
                                        "{@b Motivation:} The Beastmaster wants to find someone who can best him in combat. If he can fill the stands of his arenas with cheering crowds, so much the better: the polymorphed animals who make up his usual audience hardly appreciate his prowess.",
                                        "{@b Powers:} The Beastmaster can use any of the following spells at will: charm monster, speak with animals, and speak with monster. He may also polymorph other once per turn.",
                                        "In combat, this Incarnation's catlike agility and combat prowess give him AC 0 against any opponent he can see. He can also parry weapons with his bare hands twice per round, deflecting any successful hit against him with a save vs. paralyzation (7 or better); success means he takes no damage. If he fails to deflect the weapon, he takes damage normally.",
                                        "Because of these abilities, the PCs' only hope is teamwork. The Beastmaster is AC 8 from behind and cannot parry attacks he can't see coming.",
                                        "{@b Identifying Quote:} \"You'll make fine sport!\""
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Exploring the Room",
                                    "entries": [
                                        "This is a primeval jungle filled with creatures like elephants, lions, and monkeys; use the Monstrous Compendium's terrain encounter tables for Tropical or Subtropical Forest, Plain, Rough, and Swamp. However, replace all listings for intelligent beings with silver slimes, which maintain this room and seal fractures in the bedrock. (See the appendix for the slime's description.)",
                                        "The PCs' encounters in this room depend on their mode of travel.",
                                        "{@b Aboard ship:} Manoeuvring a ship through the jungle is impossible at ground level, but above the trees travel is easy. At this point, the PCs can fly straight for the waterfall or one of the arenas.",
                                        "However, unusual animals or dwindling supplies might entice them to land. Flying creatures could attack and make off with supplies; this would force a landing for hunting and foraging. Luring the PCs to the ground is left to the DM's discretion.",
                                        "{@b Afoot:} On foot, the PCs force their way into the jungle. In the thick underbrush, without discernible paths or trails, they soon lose all sense of direction. Vines and branches snap and twist as if they had a life of their own (though they never actually attack).",
                                        "The PCs are forced to cut their own path with swords and magic. Clearly, this room is a good place to stock up on supplies. Water and game animals are plentiful. At the DM's discretion, wizards can procure strange ingredients suitable for material components or potions.",
                                        {
                                            "type": "entries",
                                            "name": "The Arenas",
                                            "entries": [
                                                "Eventually, the PCs will arrive at one of the Beastmaster's arenas, either by accident or by design.",
                                                "Four of the arenas are little more than open-air amphitheatres, each designed for a different kind of combat. The differences among them are few: One is covered with a mesh screen, allowing aerial combat; another is flooded, for aquatic combat; one is flat and open, with a dirt floor, suitable for land combat; another contains a maze of stone walls.",
                                                "The last arena, the one in the wall opposite the entrance, is entirely different. It dwarfs the others, and seems designed for all manner of combat.",
                                                "{@b Locations:} Consult the map included in this supplement. On Face A of the cube stands the aerial arena; on Face B, the aquatic combat arena; Face C, the ground combat arena; Face D, the catacomb arena; and on Face E is the main arena, the Beastmaster's pride and joy. Face F, the entrance from the Hive's central sphere, has no arena.",
                                                "{@b Common features:} Each of the four small arenas resembles a Roman Colosseum. Thirty feet of open ground separate each small arena from the jungle. The circular amphitheatres are 100 feet in diameter and stand 30 feet tall. Fifteen-foot archways lead inside.",
                                                "The grandstand terraces are cut from solid rock. A four-foot wall separates the seats from the field. Four wooden gates spaced evenly around this wall lead onto the field.",
                                                "Looking around, the PCs notice that the grandstands look wrong. Rather than seats, the stands consist of 5' wide shallow depressions in the stone. They were, in fact, designed for crowds of beholders. The Sazaur used the amphitheatres for entertainment, pitting various beasts against each other or against prisoners.",
                                                "The four small arenas are all deserted. They were clearly used at one time, but have fallen into disuse: the aerial arena's netting has holes, the aquatic arena's water is stagnant and foetid. etc."
                                            ]
                                        },
                                        {
                                            "type": "entries",
                                            "name": "The Main Arena",
                                            "entries": [
                                                "This two-story building is circled by a 20-foot-wide moat fed by a cascading waterfall. The moat is filled (as all good moats must be) with carnivorous creatures. Beyond the moat, a clearing 100 feet wide leads to the jungle.",
                                                "In general, the main arena is laid out like its smaller cousins. It's much bigger and measures 200 feet across. Like the small arenas, it has 30' walls and 15' archways.",
                                                "There is, however, one difference. On the ground floor, as the PCs pass through the archways, the stench becomes almost unbearable. On the ground beneath the seats stand dozens of large cages filled with all kinds of jungle animals. All of the creatures look crazed and wild-eyed from hunger, fear, and long captivity.",
                                                "Within, a large field contains an area designed for each combat type: aerial, ground, aquatic, and \"subterranean.\""
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Meeting the Beastmaster",
                                    "entries": [
                                        "Eventually, the Beastmaster and his minions locate the PCs. This should occur after the PCs have had a chance to explore the main arena. If the players show no interest in the buildings, capture them quickly to keep the plot moving.",
                                        {
                                            "type": "inset",
                                            "name": "Long before they see anything, the PCs hear his approach:",
                                            "entries": [
                                                "The jungle noise grows to even greater levels. Then the underbrush parts and silence descends; eerie, unnatural silence. You see a man. At least you think it's a man.",
                                                "The figure is very tall and is covered head to foot in thick, matted, black hair. He's dressed only in a loincloth. A bronze amulet is affixed to his chest. The amulet contains a withered red eye, so large that it must be a beholder's.",
                                                "All around him are the beasts of the jungle. Specifically, the party is surrounded by over a dozen huge apes , who watch the characters keenly."
                                            ]
                                        },
                                        "The Beastmaster shouts out, \"Ho, new creatures in the forest! What fine sport you'll make! Come, let's go to the arena and I will allow you to fight for your freedom.\"",
                                        "Four huge apes grab and carry each PC. They lope easily through the jungle toward their destination: the main arena.",
                                        "TODO:",
                                        "Apes (1 2-24): AC 6;MV 12(9 in trees): HD 5; hp 34 each; #AT 3; Dmg 1-411-41 1-8;SA if both claws strike on the same round, victim takes an additional 1-8 damage; SD +2 bonus to surprise roll; AL N: THACO 15.",
                                        {
                                            "type": "entries",
                                            "name": "Prisoners of the Beastmaster",
                                            "entries": [
                                                "The apes strip the PCs of weapons, clothes, and other possessions, then throw them roughly into the pens beneath the main arena. Each PC gets his own pen, and the characters are widely separated. No conspiring to escape!",
                                                "The squalor and filth are even more overpowering than before. The cages have clearly never been cleaned in the hundreds of years of their existence. Starved, crazed-looking animals of all types occupy the pens around the characters. Occasionally, a predator snaps at the bars separating him from a potentially tasty PC.",
                                                "Escape is all but impossible. The cage locks are imbued with the antimagic power of the beholder, and thus are immune to knock and similar spells. The guards, four huge apes per PC, are too stupid to trick and too strong to overpower.",
                                                "If the PCs fail to escape (there is almost no chance of them escaping), they sit in their ill-smelling cages for approximately one hour. Then the Beastmaster appears, flanked by ape guards who bear the PCs' possessions.",
                                                {
                                                    "type": "inset",
                                                    "name": "Read this to the players:",
                                                    "entries": [
                                                        "\"Don your armour,\" the hairy man says. \"Wield your weapons skilfully and you may live.\" He turns and heads for the field. \"Perhaps these are the ones to best me,\" you hear him mutter. Then his laughter echoes throughout the stadium."
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "type": "entries",
                                            "name": "In Glorious Battle",
                                            "entries": [
                                                "The PCs must fight the Beastmaster in order to accomplish their mission and leave this chamber.",
                                                "The Beastmaster fights in straightforward fashion. He picks one opponent as the most dangerous, and remains on guard against him. At the same time, he picks another opponent as the weakest, and does his best to kill that opponent outright. He fights this way because his main concern is the sport. If the battle goes poorly, or if the PCs somehow taunt him into anger, he stops playing and tries to kill the toughest enemies first.",
                                                "The Beastmaster is hard to overcome, but clever teamwork can carry the day. Alert players might catch on to the Beastmaster's strategy and turn it to their advantage. Many dirty tricks are possible; these do not offend the Beastmaster, since all is fair in Nature. But one thing h e does not tolerate is cowardice; all exits to the arena are guarded, and the Beastmaster goes after fleeing foes before all others.",
                                                "If the PCs slay the Beastmaster, the central crystal remains lit, but the entire domain goes (so to speak) wild. Every creature turns on the others, and the animals soon slaughter themselves. The PCs must escape the arena and the room, avoiding the rampaging animals."
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "type": "section",
                            "name": "Room 4 - Pleasant Dreams",
                            "entries": [
                                "This room is the domain of the Queen's Eye Incarnation representing the beholder's sleep power.",
                                {
                                    "type": "entries",
                                    "name": "Background",
                                    "entries": [
                                        "The Sazaur constructed this room to provide long-term storage of supplies, prisoners, or whatever struck their fancy. This chamber uses the sleep power of the Queen's Eye to keep its occupants docile, while other magic prevents ageing and decay.",
                                        "The eye later developed into the Incarnation called Zhangzhala. This creature feasts on the dreams of others, and he seeks new minds to enshroud in his timeless mists."
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "The Chamber of Dreams",
                                    "entries": [
                                        {
                                            "type": "inset",
                                            "name": "Read this to the players",
                                            "entries": [
                                                "A soft, indirect light fills the air. The temperature is warm, warm as a soothing hot spring. No sound disturbs the peace of this place save the whisper of a breeze barely felt. The air is heavy, like perfume. Vapours waft on the constant, balmy breeze. A comforting mist surrounds you."
                                            ]
                                        },
                                        "At first, the aroma seems fresh and appealing. But the longer the PCs remain in this room, the more cloying the scent becomes.",
                                        {
                                            "type": "entries",
                                            "name": "The Floor",
                                            "entries": [
                                                "Walking gingerly, the PCs soon find that the entire floor is covered with a soft, springy substance. The mist that covers the floor cannot be blown away, so they can't tell what's down there. (In fact, this is simply more mist, thick enough to walk upon.)",
                                                "If a character stands still for any length of time, he begins to slowly sink into the floor. The longer he remains stationary, the faster he sinks.",
                                                "A character who has sunk into the floor below his knees can begin moving again with little difficulty. As he sinks deeper and deeper, however, he needs more and more help to get out, until at waist-level or deeper, the character must be pulled out by others.",
                                                "The deeper a PC sinks, the more lethargic he becomes. The other character's voices seem to fade. The mists start to take on vague, shadowy shapes: shapes the PC's free comrades cannot see, of course. These shapes become clearer as the character sinks deeper into the mists of dream."
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Incarnation",
                                    "entries": [
                                        "Zhangzhala is a dream-master. He can draw dreams from the subconscious of his victims or cause them to dream whatever he wants. He is effectively immune from attack, and so he has no game statistics. For the method of his defeat, see below.",
                                        "{@b Appearance:} The dream-master looks different to each PC. Play this up as much as possible. To a human male, he might seem the most ravishing of women: to a priest, a deity incarnate; to a lover of horses, the finest magical steed; and so on. Whatever he looks like, however, the beholder's eye remains fixed on his forehead.",
                                        "In actuality, Zhangzhala is the thick mist that covers the floor.",
                                        "{@b Personality:} Zhangzhala is somewhat ethereal, light-headed, easily distracted, very persuasive, and beguiling in his (feigned) innocence.",
                                        "{@b Motivation:} Naturally, Zhangzhala wants to add the PCs to his collection of dreamers. The more dreamers he has, the more power he gains.",
                                        "{@b Powers:} Within his dream world, Zhangzhala has absolute power. He can give his victims sweet dreams or horrifying nightmares. He can also draw monsters and other creatures out of his victims' imaginations, much as a phantasmal killer spell cast by a 20th-level wizard.",
                                        "Zhangzhala also has dream-related abilities like sleep, charm person, and charm monster. The DM can add other appropriate abilities; they are irrelevant to the method of his defeat.",
                                        "{@b Identifying Quote:} \"I can bring you peace, joy, love-whatever you desire. You have but to embrace me.\""
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Encounters in Dreamtime",
                                    "entries": [
                                        "If a PC sinks all the way out of his friends' reach, he awakens standing on a featureless white floor, beneath a low ceiling of thick, white clouds. The fog is still present, but seems clearer somehow.",
                                        "All trace of drowsiness is gone, and the PC is free to move around. However, he's moving in his dreams, not in reality. If the character has some physical tie to the party (such as a rope), he can move freely and tug on the rope as he likes, but the other party members notice nothing. Communication with them, too, is imaginary.",
                                        "In this realm of dreams, each PC has three very short encounters. Take each player aside and run him through the encounters individually. Even if the PCs all sink into the mists next to each other, each is alone in the realm of dreams and must face his challenges separately.",
                                        {
                                            "type": "entries",
                                            "name": "The Carrot",
                                            "entries": [
                                                "After the character has had a few minutes to get adjusted to his new environment, he sees a figure approaching out of the fog. As it nears, the character recognizes it as that person or creature who is most dear to him: a parent, lover, sibling, lord, deity, totem, etc. The figure approaches the PC and embraces him.",
                                                {
                                                    "type": "inset",
                                                    "name": "Read this to the player:",
                                                    "entries": [
                                                        "\"Welcome, my love. Welcome to the Dreamworld. All that you have ever desired will be granted to you here. Come with me and we will fulfil your greatest wish.\" The figure stretches out a hand and beckons."
                                                    ]
                                                },
                                                "The PC almost certainly realizes that this couldn't be the person it appears to be; especially dense PCs get an Intelligence check. The PC also gets a Wisdom check to withstand the temptation. If the player realizes what is going on and refuses the offer, that character automatically does so as well.",
                                                "If the PC takes the outstretched hand, he is led away into a paradise beyond his wildest dreams. Unfortunately, he also slips into a deep coma from which he may never recover (see below).",
                                                "If the PC refuses, his loved one gives a silent scream of pain and rage and bursts into flames, vanishing within moments."
                                            ]
                                        },
                                        {
                                            "type": "entries",
                                            "name": "The Stick",
                                            "entries": [
                                                "Soon another figure approaches out of the mists, this time much faster. This creature is the object of the PC's deepest fear or loathing. By the time the character recognizes the shape, the creature is almost upon him, charging full-steam into battle!",
                                                "Like the first encounter, this monster is not what it seems. The creature appears to attack, but it always misses. Conversely, the PC always hits, and always causes a serious wound.",
                                                "If the PC wounds his foe three times, the monster dies. Suddenly, the PC is surrounded by a cheering mob, who raise him up on their shoulders and carry him away into a town that appears out of the mists. The character is given everything he wishes and is revered as a hero; but again, he is trapped forever in the realm of dreams.",
                                                "If the character refuses to strike at his enemy, the creature attacks three times. Each attack looks fiercer than the one before, and each comes closer to hitting, but each misses. After the last attack, the creature bursts into flames just as in the first encounter."
                                            ]
                                        },
                                        {
                                            "type": "entries",
                                            "name": "The Pay-off",
                                            "entries": [
                                                {
                                                    "type": "inset",
                                                    "name": "Read this aloud to the player:",
                                                    "entries": [
                                                        "Though you see nothing but fog, an eerily soft voice speaks, seeming to come from all directions at once.",
                                                        "\"Congratulations, mortal. You have done well, and bested me in my two challenges. Your reward is the granting of a single wish. Choose wisely, and tell me: What is it you most desire?\""
                                                    ]
                                                },
                                                "There are two right answers. If the PC asks to be awakened, he abruptly shoots straight up through the cloud ceiling, appearing at the spot where he entered the dreamland. This character never again sinks into the mists and is forever immune to the power of Zhangzhala.",
                                                "If the PC says that his greatest desire is to see the Dreamlord destroyed, that wish, too, will be granted. Zhangzhala is bound by very few things, but this is one of them. See below for what happens next.",
                                                "Any other request will be \"granted,\" but not in the way the PC wants. The character receives the wish, but is not allowed to leave the dreamtime. Even if pulled back through the clouds, the PC remains in a coma."
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Aftermath",
                                    "entries": [
                                        "{@b If Zhangzhala is destroyed:} A deep rumbling noise, audible to everyone awake or asleep, fills the air. The fog and clouds explode in a burst of fire, doing ld8 damage to everything in the room and stunning the characters.",
                                        "When the PCs recover, the mists are gone and the central gem has gone dark. If they stay to investigate the room, they find tons of debris scattered around the walls. They also find several intelligent creatures (DM's choice), alive, but completely and irreversibly mindless, their intellects long since sucked dry by Zhangzhala. (At the DM's discretion, one or more of these beings can be restored to awareness to serve as replacement PCs or allies.)",
                                        "Any character who spent less than a day under the control of Zhangzhala returns to his original condition, fully awake.",
                                        "{@b If Zhangzhala survives:} Each PC in a coma loses 1 point from each ability score every hour he remains in the room, even if he is pulled out of the clouds. If the character is taken out of the room, he ceases to worsen, but does not improve or awaken. A restoration spell or similar healing magic ends the coma, awakening the character and restoring all lost abilities."
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Staging Advice",
                                    "entries": [
                                        "Play New Age music very softly. Speak in a voice as smooth as velvet. Slow the pace of delivery to a crawl. Slow... soft... even. If the players are normal, this will drive them wild with frustration. That's the whole point."
                                    ]
                                }
                            ]
                        },
                        {
                            "type": "section",
                            "name": "Room 5 - Ricochets",
                            "entries": [
                                "This room is the domain of the Queen's Eye Incarnation embodying the beholder's telekinesis power.",
                                {
                                    "type": "entries",
                                    "name": "Background",
                                    "entries": [
                                        "The Arcane constructed this giant room in the following fashion: First, they engraved the walls with telekinesis runes the size of buildings. Next, they enchanted each wall with a permanent wall of force and protected the central crystal with another impenetrable wall of force. Then they released thousands of 5,000 pound stone spheres into the room and plugged the tunnel with a repulsion spell that only affects stone. Last, they placed the eye in the room.",
                                        "All of this served to create an environment absolutely crackling with telekinetic magic, the better to nourish the eye's growing power. As the spheres touched the runic symbols, they vaulted high into the air via telekinesis magic, ricocheted off one another, and occasionally touched the central crystal, thereby transferring their accumulated magic to its eye.",
                                        "The eye developed self-awareness more slowly than its counterparts in other rooms because of the lack of intelligent beings here. Nevertheless, this Incarnation is as deadly as the rest."
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Entering the Room",
                                    "entries": [
                                        {
                                            "type": "inset",
                                            "name": "Read this to the players:",
                                            "entries": [
                                                "One of those tall armour suits stands near the tunnel exit. As you approach, a round shape whisks across the tunnel mouth, very fast. It's gone before you recognize it."
                                            ]
                                        },
                                        "This is one of the stone spheres. The Sentinel suit is empty.",
                                        {
                                            "type": "inset",
                                            "name": "Read this to the players:",
                                            "entries": [
                                                "Another giant room. This one looks like a cube with bare grey walls, but it's hard to get a sense of scale. Every face of the cube is carved with an orderly array of pale green symbols, all alike. It looks like there are about 100 symbols on each wall.",
                                                "You look up, and the face overhead is like the others. Again you experience vertigo and the sensation that you're standing upside-down above the ground.",
                                                "A bright light drifts slowly through the middle of the room. Shadows like dots move along the walls as it goes. The shadows are being cast by many, many round spheres that are flying straight across the room, as though shot from slings. They move in all directions. You can't see one close up, but at the rate they're travelling, you guess you'll see one soon."
                                            ]
                                        },
                                        {
                                            "type": "entries",
                                            "name": "Details of the Room",
                                            "entries": [
                                                "{@b The crystal:} This ten-sided, 50-yard crystal is protected from collision damage by a permanent wall of force, but it still recoils from collisions. It drifts randomly around the room at variable speed, usually 2-8\".",
                                                "The drifting crystal causes bizarre, twisting shadows that can distort perception. Characters making missile attacks may suffer -1 to -3 penalties at the DM's discretion.",
                                                "{@b The spheres:} About 10,000 of these 20', 5,000 pound globes of hard brown rock fly in straight paths in all directions at a rate of 24\". After 800 years of ricochets, the giant spheres remain intact, because all are protected by Otiluke's Telekinetic Sphere spells. The spells also reduce the sphere's effective weight to about 350 pounds.",
                                                "The PCs' ship has one or two close shaves while sailing through this room. When a sphere is about to collide with them, allow the spelljamming wizard or priest to make a Dexterity check to evade the sphere. PCs on foot also receive this check. Failure means collision and 2d4 points of hull damage (to the ship) or 3d6 hp to characters.",
                                                "{@b The runes:} All the runes in this room look alike. They are 600' tall and wide. Each face of the room shows 81 runes in a 9x9 array, separated by 600' gaps. The gaps are elevated, contoured slopes that send spheres on a slow roll toward the rune \"valleys.\"",
                                                "A rune casts Otiluke's Telekinetic Sphere on any object (or PC!) that touches it. Then it shoots the object up at a rate of 24\" in a random direction. Unknown to the PCs, one rune is improperly made, so that one time in 100,000 its spell is badly cast: The target sphere rises, but it shatters in a collision. This has produced the room's rubble and drifting debris.",
                                                "The PCs have seen this alien style of rune on the Room 1 murals and perhaps on the undead landscapes of Room 11, the death ray room.",
                                                "{@b Gravity:} In this room, as in most of the others, gravity pulls down on each face, making every wall a floor. But here, the Arcane have neutralized each wall's gravity at an altitude of 200 feet. Above that invisible plane, objects have only their own gravity planes, just as in open Wildspace.",
                                                "So the spheres that rise above the 200' mark drift onward until they encounter another wall's gravity. PCs above 200' drift slowly in a random direction until they cross a gravity boundary and then fall like rocks."
                                            ]
                                        },
                                        {
                                            "type": "entries",
                                            "name": "Meeting Corundum",
                                            "entries": [
                                                "Among the thousands of smooth spheres drifting through the room, one stands out: an agglomeration of small boulders and rubble, 20' in diameter. If the PCs' ship approaches the central crystal, give each PC an Intelligence check to perceive this single, irregular sphere amid the others. In the vast gulf of air, this is like spotting a marble in a marketplace; but the sphere is also seeking the PCs, making detection more likely.",
                                                "This collection of rocks and pebbles marks the surface of an Otiluke's Telekinetic Sphere cast by this room's Incarnation, Corundum. Corundum dwells in the centre of this hollow sphere, periodically expanding it to gather floating debris. Once he collects it within the sphere, Corundum keeps the detritus pressed against the sphere's wall.",
                                                "When the PCs encounter his protective shell, Corundum draws back the rubble on both sides of a hemispherical line, so that the rocky surface seems to open like an eyelid. Inside floats a tiny sphere less than a foot across: Corundum.",
                                                "The eye spends a round or two examining the PCs and their ship. Suddenly, the ship starts to vibrate; it's flying apart! The masts pull up, planking peels back like banana peels, and ropes unravel into individual fibres. (Living beings and magical items are untouched.) This inflicts 1 hull point per round until the PCs can escape, attack, or negotiate with Corundum."
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Incarnation",
                                    "entries": [
                                        "TODO:",
                                        "Corundum: AC 1;MV FI24; HD 7; hp 36; #AT 1; Dmg special; SA see below; SD immune to all bludgeoning and collision damage; AL NE; THACO 15.",
                                        "{@b Appearance:} Corundum has had no exposure to anything but rock and runes. When the PCs appear, he draws from them mental pictures of close friends, animals, and objects, especially those related to collisions, such as bighorn rams or hammers. Then Corundum shifts ceaselessly among these various forms, never looking like the same thing twice.",
                                        "{@b Personality:} Corundum treats the PCs as more things to be manipulated. He has no compassion or remorse, but enjoys having power over the PCs.",
                                        "{@b Motivation:} Take things apart and put them together in new ways.",
                                        "The Incarnation is fascinated with the ship and wants to disassemble it. Once Corundum reduces the ship to component boards and nails, he'll put it back together again in a different way. He might even return it to the PCs if they grovel, flatter, and wheedle.",
                                        "{@b Powers:} Corundum can cast telekinesis or Otiluke's Telekinetic Sphere at will. He can dispel his spheres without speaking. Corundum is immune to damage from collisions or bludgeoning blows.",
                                        "{@b Identifying Quote:} \"This is some kind of conveyance, this collection of items? I will dismantle them now. No, you cannot stop me, so don't bother to try.\"",
                                        {
                                            "type": "entries",
                                            "name": "Fighting Corundum",
                                            "entries": [
                                                "Once per round, Corundum tries to envelop one or more PCs in a sphere. To do this, he must drop his own protective sphere. If the attack succeeds, he hurls his victim(s) toward the current location of the room's glowing crystal. Beyond 200' away, the sphere vanishes, leaving the victim to either float or fall. If no PC is left to bother him, Corundum goes back to dismantling the ship.",
                                                "If the PCs inflict any damage on Corundum, he restores his protective sphere, spends several rounds gathering rubble as camouflage, and then retreats at top speed toward the glowing crystal. He will not confront the PCs again."
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Troubleshooting",
                                    "entries": [
                                        "{@b Corundum destroys the ship:} Corundum (assuming he survives) can reassemble the ship from a distance, then says \"Leave my domain and bother me no more!\"",
                                        "If Corundum is dead, the PCs can salvage the helm and construct a ramshackle raft, or even attach the helm to a sphere and fly on that. The repulsion spell on the tunnel mouth won't interfere with the spelljamming sphere.",
                                        "If that doesn't work, surviving PCs can climb the monolithic tunnel entrance and return to Room 1. In their explorations afoot, they stumble on the wreck of a small Wasp spelljamming ship (see the campaign set). This is the ship that crashed and stranded the nixies who now inhabit Room 9(see that entry for details). A generous DM can allow the PCs to repair the ship."
                                    ]
                                }
                            ]
                        },
                        {
                            "type": "section",
                            "name": "Room 6 - The Grind Canyon",
                            "entries": [
                                "This room is the domain of the Queen's Eye Incarnation representing the beholder's flesh to stone power.",
                                {
                                    "type": "entries",
                                    "name": "Background",
                                    "entries": [
                                        "The Sazaur beholders originally intended this chamber not only to house the flesh to stone Queen's Eye, but also to house livestock to feed the Hive's inhabitants.",
                                        "To the first goal, the Sazaur stocked the room with medusae, cockatrices, basilisks, and other stoning monsters. To the second goal, the beholders stocked it with hardy goats and hardier goatherds: stone giants, tough enough to survive the rigours of the asteroid's routine, but dull-witted enough for the beholders to keep them in line. Or so the beholders thought.",
                                        "After the death of the Sazaur nation, the eye developed into an Incarnation calling itself Stennor. Stennor metamorphosed into a beholder-like being with traits of the stoning monsters in this chamber.",
                                        "Stennor's power gradually saturated all the stone in this chamber, giving it an unusual enchantment. Though Stennor could turn flesh to stone, the stone in this room could turn inanimate objects to stone, temporarily. Brief contact with stone turns any inanimate object into rock for a few seconds. Extended contact turns objects into stone for several minutes, or even permanently.",
                                        {
                                            "type": "entries",
                                            "name": "Stennor's Onslaught",
                                            "entries": [
                                                "For a short time after the death of the Sazaur, the stone giants simply bred their goats and lived primitive, carefree lives. Then Stennor emerged from the canyons below and began to terrorize them, turning many giants and goats to stone.",
                                                "The stone giants fought back. Slow-thinking but not stupid, they created defences against Stennor.",
                                                "They quarried huge, flat pieces of stone, shaped them into giant shields, and embedded lead crystal windows in them. The shields stopped Stennor's flesh to stone ray. Because Stennor is noisy, the giants usually heard it before it floated within range. They had time to bring the cumbersome shields to bear.",
                                                "The giants learned to fight in formation, with a shield giant protecting a rock-laden missile giant. Their fierce throwing attacks could never kill Stennor, but they hurt it enough to prevent it from flying into the giant camps with impunity.",
                                                "Stennor retaliated. It began playing tricks with boulders and gravity. Hundreds of tons of stone, ranging in size from small pebbles to huge boulders, floated through the chamber. The stone giants couldn't prepare for these stones; sometimes they would crush a house or palisade wall. With this floating camouflage, Stennor could drift motionless among them, striking suddenly from ambush.",
                                                "For a dozen generations, an uneasy balance has existed in the chamber. The giants are good at eluding the monsters and Stennor. But many giants, goats, and intruders from outside the asteroid become lonely statues trapped forever in this room."
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Entering the Room",
                                    "entries": [
                                        {
                                            "type": "insert",
                                            "name": "Read this to the players:",
                                            "entries": [
                                                "This is a gigantic, roughly spherical chamber. It is approximately one and one-half miles across. A glowing crystal in the centre illuminates it like a sun. The ground is covered with rocks in many places, but green grass and scrubby trees and bushes grow elsewhere.",
                                                "Stones float through the air all over the chamber. Some are small pebbles no bigger than sling stones. Others are giant boulders as large as a palace. The air is thick with them. You think you could sail through them, but even the best pilot can't miss all of the small rocks.",
                                                "The ground is split with a deep canyon that runs along the floor, beneath you, to port and starboard, fore and aft, and above you. The canyon is one-quarter mile deep at its shallowest point and much deeper elsewhere. In many places, swaying ropes and wooden bridges cross the canyon.",
                                                "Below, on the grassy hillsides, you can see small villages surrounded by wooden walls. You see men tending flocks of goats. On closer inspection, these \"men\" are either very huge, or the goats are very small. The men have grey skin. Some of them see you and wave, while others run toward the little villages."
                                            ]
                                        },
                                        "PCs who examine the canyon closely can see that it descends to a flat stone floor, and that this chamber is actually a cube two miles on a side; it is built up with stone so it looks spherical, but the canyon shows its true dimensions.",
                                        {
                                            "type": "insert",
                                            "name": "Choose a PC who is wearing armour and read the following to him:",
                                            "entries": [
                                                "You hear a \"ping\" off the side of your helmet, and your helmet immediately becomes heavier. Looking around, you realize that a small floating rock has hit you.",
                                                "When you take off the helm, you see that the top of it has been turned to stone! But as you watch, it gradually turns back to normal. The effect wasn't permanent."
                                            ]
                                        },
                                        "As the characters continue, their ship, equipment, and even flesh are occasionally hit by flying stones. When equipment is hit, it turns partially to stone but returns to normal one round later. When the ship hits small stones, the same thing happens; but when it hits large boulders, the effects last one full turn before dissipating.",
                                        "When the rocks hit flesh, nothing happens. (Make sure that some PC's skin is hit by the stones so the players realize it isn't dangerous to them.)",
                                        {
                                            "type": "entries",
                                            "name": "Stones and Shields",
                                            "entries": [
                                                "When a floating, dropping, or thrown stone hits an inanimate object, it petrifies its own weight's worth of the object. For instance, if a five-pound rock hits 30-pound hide armour, then five pounds of the armour turns to stone, starting at the point of impact. This transformation lasts one round.",
                                                "When an inanimate object is hit with stones weighing ten times as much as the object within one round,it is turned permanently to stone. For example, if a four-pound long sword is hit in one round by one 40-pound boulder or four 10-pound rocks, it becomes stone perrnanentIy.",
                                                "Stone weapons do ld4 damage and break on any hit roll of 5 or below. If a magical item is turned permanently to stone, its enchantment is ruined.",
                                                "The giants' stone and lead-crystal shields do not provide absolute defences against stoning gazes and attacks. If the shield-bearer crouches behind them so no part of him is exposed, he gets +8 to saving throws vs. stoning attacks. When not used this way, the shields are useless."
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Talking to Giants",
                                    "entries": [
                                        "The PCs probably try to speak to the {@creature stone giant|MM|stone giants}. Whether they cruise over to a village or confront one of the solitary goatherds, one stone giant steps out in front with hands empty, while two others (or more, near a village) stand back with a stone in each hand.",
                                        "The first giant the PCs talk to is named Kolto. If none of the PCs speaks a giant language, then Kolto speaks a coarse dialect of the common tongue.",
                                        "Kolto is amiable but cautious. He asks questions and answers them. He provides the following answers:",
                                        "{@b Dangers:} Yes, there are many dangers here. There are medusae, gorgons, basilisks, and cockatrices in this land. The horrid Stennor rules all those monsters, and there is \"the Snake that Steals the Sun.\"",
                                        "Kolto says the giants know how to fight all these things, but they are sometimes ambushed by treacherous monsters.",
                                        "{@b Stennor:} Kolto describes Stennor as huge, like a sphere five yards in diameter. It has a great eye and an ugly wide gash of a mouth. Many pythons grow like hair on its scaly scalp. It coughs up boulders that turn unliving things to stone, and its eye projects a ray that turns living things to stone. (See the description of Stennor, below, for more details.)",
                                        "Stennor floats through the cavern, sometimes emerging to terrorize the giants and goats, sometimes floating among the boulders in ambush.",
                                        "{@b The Snake That Steals The Sun:} Every few months or years, a giant serpent emerges from the hole that the characters' ship just emerged from. The serpent seizes the sun from the middle of the sky and carries it away. This makes things dark and gives the medusae and other enemies better opportunities to stone the giants. The darkness lasts for a few hours or days.",
                                        "DM Note: This reference, to the sliding sleeve in the room's tunnel, should totally bewilder the players until the events of Chapter 5. The PCs encountered a similar legend among the Anari in Room 2.",
                                        "{@b How the giants fight the stoning monsters:} Kolto shows the PCs the giants' stone shields, which allow the giants to weather the stony attacks of all these monsters, usually. The stone shields require a minimum Strength score of 19 to use, which makes them useless to most PCs. But if the PCs want to fight Stennor and the stoning monsters, the giants happily offer their assistance.",
                                        "{@b How many giants:} Kolto says there are about 100 giants and many thousands of goats living in this chamber. He estimates there are 30 to 40 stoning monsters."
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Hunting Stennor",
                                    "entries": [
                                        "The PCs may converse with the giants as much as they please, either from their ship or on the ground. (Grass and soil do not turn their shoes to stone; only hard rock has that effect.) The giants grudgingly invite them to share their skimpy meal (skimpy by giant standards): goat meat cooked over a wood fire, goat's milk, and fresh spring water.",
                                        "If the PCs want to attack and destroy Stennor, they may. The problem is that no one knows where the Incarnation is. To flush him out, the PCs must sail through its lair, the narrow canyon that wanders across this chamber.",
                                        "Once the PCs decide to hunt Stennor, they can sail in any direction they choose. They do not find Stennor right away. Instead, things run into them.",
                                        "{@b Falling Rocks:} Rocks fall from the cliff-sides of the canyon and crash onto the ship's deck. As usual, they turn deck planking and other inanimate objects to stone, temporarily. They also \"attack\" PCs at THACO 16, and hit to do ld6 damage.",
                                        "One rock plummets to the deck every turn; roll ld6. On a roll of 1, the rock is falling toward a PC; on 2, an NPC; and on 3-6, the empty deck. Whenever large boulders hit the deck, sections of deck turn to stone, and the spelljammer has a harder time controlling the ship; make all control checks at a -2.",
                                        "{@b Cave Creatures:} Once per hour of searching, one of the stoning creatures attacks, either by springing from a concealed cave or by floating in on a boulder and dropping onto the deck.",
                                        "At least one greater medusa, one gorgon, one basilisk, and one cockatrice attack the characters before the search is finished. The gorgon cannot ride boulders; it can only spring from a cave. The basilisk can only peer out of a cave; it is too sluggish to jump at the PCs. Use the statistics for these monsters from the Monstrous Compendium."
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Stennor",
                                    "entries": [
                                        "Stennor has pulled a boulder up into a cave mouth and is holding it there telekinetically. When the PCs pass, Stennor heaves the boulder at them, slamming it into them or the ship for 3d8 damage. Stennor then floats out and attacks.",
                                        {
                                            "type": "entries",
                                            "name": "Incarnation",
                                            "entries": [
                                                "TODO:",
                                                "Stennor: AC 2; MV FI 3 (B); HD 12; hp 75; #AT 5; Dmg 2-1612-8/2-81 Special/Special; SA flesh to stone, stone to flesh, ESP four times per day, telekinesis (unlimited, as a 20th-level wizard, but only works on stones); SD one-quarter damage from stone attacks; AL CE; THACO 9; XP 13,000. Stennor has no treasure.",
                                                "{@b Appearance:} Stennor resembles a huge (15' diameter) beholder, except that instead of eyestalks, it has rock-pythons (exactly as a medusa has lesser snakes for hair); and it is covered with bronze-coloured, reptilian scales. Its small central eye is obviously one of the Queen's Eyes.",
                                                "{@b Personality:} Stennor is not clever or subtle. It enjoys ambushing enemies, mainly because of the fear this inspires.",
                                                "{@b Motivation:} Stennor does not eat its dead prey; its cruelty is just a leftover beholder personality trait. It is lazy and prefers to let stoning monsters do most of the damage in this room. Stennor unconsciously recognizes that it gains no power when it petrifies a victim, but only when the monsters do. However, it does not bypass an easy ambush.",
                                                "{@b Powers:} In addition to the slow levitation of real beholders, Stennor can cast ESP four times per day and telekinesis once per round, in lieu of any one of its normal attacks. Its two special attacks are its flesh to stone ray from its central eye (identical to the usual beholder attack), and the special rock it coughs out of its mouth.",
                                                "Each round, Stennor coughs out either a one-pound inanimate object to stone rock (identical to the ones floating in this cavern, but as effective as if it weighed 300 pounds), or a stone to flesh rock identical to the normal stone to flesh spell. It can spew either rock to a range of 30 yards.",
                                                "The second rock turns one entire object (statue, suit of armour, weapon) into living flesh or unliving leather if the object doesn't save vs. petrification.",
                                                "Finally, Stennor can bite once per round for 2d8 damage, and any two of its snake-hairs can bite once per round for 2d4 damage each.",
                                                "{@b Identifying Quote:} \"Flee! Freeze! Die! All Same!\"",
                                                "{@b Tactics:} Stennor's favourite fighting method is to move in close, biting in all directions. Each round, it tries to use its central eye to turn one enemy to stone.",
                                                "Stennor also likes to cough up an inanimate object to stone rock to hit a character's armour or weapon, turning it to stone; and on the subsequent round, it coughs up a stone to flesh rock to hit the same target, turning it to leather.",
                                                "Imagine a PC's shock when his prized magical sword turns into something like a leather belt, or his plate mail +3 becomes non-magical hide armour! This is a handy way to get rid of excess magical treasure accumulated by the characters."
                                            ]
                                        },
                                        {
                                            "type": "entries",
                                            "name": "Resolving Combat",
                                            "entries": [
                                                "Conduct the battle normally. Once Stennor drops below 20 hit points, it flees. First, it floats away along the cavern, but the faster PCs have no problem keeping up. Finally, Stennor floats into a tunnel mouth, forcing pursuers to leave their ship and follow on foot. Fortunately for the PCs, it chooses a dead-end corridor. But it fights viciously when it is injured and trapped.",
                                                "When Stennor is dead, its central beholder eye cracks and falls out of its body cavity. Fortunately, nothing disastrous happens upon the Incarnation's death. In fact, the many victims it has petrified over the centuries revert to normal. The giants' goat herds suddenly grow immensely larger.",
                                                "At the DM's discretion, one or several stone giants can join the PCs' party. They can be replacement PCs or NPC muscle. In some of the other rooms, the PCs need it!"
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Troubleshooting",
                                    "entries": [
                                        "{@b PCs try to destroy the central crystal:} The giants are very unhappy, and try to warn the PCs against this. They know that with the sun destroyed, the grass will die, the goats will die, and then they will all die. If the PCs succeed, the giants try to exact revenge.",
                                        "{@b PCs carry away the chamber's stones:} With Stennor dead, the stoning rocks lose their magic within a day. Twenty-four hours later, they become ordinary rock.",
                                        "{@b PCs want shields of their own:} An anti-stoning shield made to human size takes four times as long to manufacture as an ordinary shield. It weighs 50 lbs. and requires Strength 18 or better to wield. Instead of granting +8 to saving throws vs. stoning attacks, it grants only +4 because of the reduced size and thickness."
                                    ]
                                }
                            ]
                        },
                        {
                            "type": "section",
                            "name": "Room 7 - Emptier Than Empty",
                            "entries": [
                                "This room holds the Queen's Eye embodying the beholder's disintegrate power. Unlike the other small rooms of the Hive, however, no Incarnation rules this room. In fact, there is hardly anything left here at all.",
                                {
                                    "type": "entries",
                                    "name": "Background",
                                    "entries": [
                                        "When they started building the Hive, the Sazaur constructed this room first. Then, after depositing the Queen's Eye here, the Arcane enchanted the walls with gigantic, permanent disintegrate fields. Thereafter, the Sazaur disposed of the rubble and waste material of construction by throwing it into this room. Not only did the disintegration process tidy up the workplace, it augmented the room's sympathetic magic and strengthened the eye's power.",
                                        "But this room alone of the ten suffered badly when the Sazaur beholders were annihilated. With no further flow of material to disintegrate, and no stable ecosystem to provide sympathetic vibrations, the eye stagnated.",
                                        "The eye still possesses unusual power, absorbed from the other eyes during its crystal's tenure as part of the assembled Ravager (see next chapter). But without a nurturing sympathetic environment, the eye did not develop into an Incarnate personality.",
                                        "This room is the equivalent of the \"empty rooms\" in conventional dungeons, with one difference: This room is dull, but still dangerous."
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Entering the Room",
                                    "entries": [
                                        {
                                            "type": "inset",
                                            "name": "Read this to the players:",
                                            "entries": [
                                                "For a moment you think you must have sailed out into space again. But this is another colossal cubic room, each square wall as big as the country side surrounding a large city. But there are no cities here and no countryside. All you see are blank, black walls.",
                                                "In the centre of the room floats a crystal like the ones you've seen in other rooms. Its light shines very brightly, bright enough to pick out the borders where one black wall meets another.",
                                                "Looking back, you see the monolithic tunnel entrance you emerged from. This wall is also dead black. The outside of the tunnel looks shinier than usual.",
                                                "You see nothing else in this room."
                                            ]
                                        },
                                        "Anything touching the walls of this room is instantly disintegrated. However, a wish or other powerful magic can restore the destroyed object.",
                                        "The tunnel sleeve is protected from disintegration by a permanent wall of force. Should PCs somehow dispel this field, the disintegration spell instantly eats away the 500-yard monolith of the tunnel sleeve. Assuming they are airborne, the PCs can still exit through the remaining tunnel section beyond the field. When the Ravager assembles in the next chapter, it cannot use the disintegrate crystal, even if the crystal and the eye survive."
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Encounter",
                                    "entries": [
                                        "The only encounter in this room involves the eye itself. The tiny object orbits the central crystal, absorbing what feeble magic it can; when the PCs enter the room, the eye instantly senses and zooms toward them at 24\" per round.",
                                        "The eye, about the size of a soccer ball, disintegrates everything in a straight line ahead of it (save vs. death magic at -2 to negate all damage). In this respect, treat it as a sphere of annihilation; however, it cannot be influenced, and it can be attacked. The eye picks no single target but tries to turn the PCs' ship into Swiss cheese.",
                                        "TODO:",
                                        "The eye: AC 0; MV 24; HD 4; h p 19; #AT 3; Dmg see above; S D immune to disintegrate magic and all mental powers; AL N.",
                                        "The eye has no real intelligence beyond a rudimentary survival instinct. If damaged, the eye retreats at full speed toward the crystal. If the PCs trap or corner it, the eye fights to the death."
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Aftermath",
                                    "entries": [
                                        "If the PCs destroy the eye, the central crystal explodes, doing 4d8 hp damage to everything in a 100' radius and 2d8 within 1000'. This plunges the room into darkness. PCs can make their way out by targeting the light at the end of the tunnel leading to Room 1.",
                                        "If the explosion looks likely to send the PCs hurtling to the walls of the room, say that the crystal's destruction dispelled the walls' disintegrate fields, leaving only bare rock. Whew!"
                                    ]
                                }
                            ]
                        },
                        {
                            "type": "section",
                            "name": "Room 8 - Village of the Damned",
                            "entries": [
                                "This room is the domain of the Queen's Eye Incarnation representing the beholder's fear power.",
                                {
                                    "type": "entries",
                                    "name": "background",
                                    "entries": [
                                        "When the Arcane constructed this room, they found its eye difficult to accommodate. It required subjects that it could frighten. Unsure what subjects would best suit the eye's needs, the Arcane created great pools of \"holomire,\" a mud-like substance that the eye could form into any shape it pleased. Brown holomire could be used to form inanimate objects; the more precious grey holomire could achieve a magical life of its own.",
                                        "As the Eye developed into a full-fledged Incarnation, its need to experience others' fears also grew. The Incarnation, now calling itself I'kok after a dimly remembered beholder monarch, created many humanoid creatures from the grey holomire. (As a beholder relic, it regarded humans as a suitably inferior race to terrorize.)",
                                        "The creatures instinctively built their own community, where they continue to live and work to this day. I'kok secretly dwells among them, inflicting random acts of terror to bask in their fearful reactions."
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Incarnation",
                                    "entries": [
                                        "TODO:",
                                        "I'kok: AC 0; MV 12, FI 3; HD 9; h p 54; #AT 1; Dmg 2-8;SA radiates fear; SD anti-magic ray, polymorph at will; MR 50%;AL CE; THACO 12.",
                                        "{@b Appearance:} Unlike other Incarnations, I'kok frequently changes form, polymorphing as necessary to keep the Reps (see below) from suspecting his true identity. He typically changes form every few days.",
                                        "I'kok always assumes a form that mingles unnoticed among Rep society. Usually, I'kok takes the form of a humanoid, but he sometimes takes the shape of a dog or other common animal. Regardless of his shape, what distinguishes I'kok from the genuine Reps are his blood-red eyes, which glow dully in the dark.",
                                        "I'kok's favourite shape is that of an overweight human, about six feet tall and weighing nearly 300 pounds. Like the Reps he resembles, I'kok's flesh is lumpy and coarse, grey in colour, and smells faintly like rotten fish. He has no facial features, except for his beady red eyes and a wide slash for a mouth that seems to divide his head in half.",
                                        "Like the Reps, I'kok wears simple clothing made from the fibrous sajj plants that grow freely on Face 1 of this room. Unlike the Reps, he always wears a cowl or hood to conceal his eyes. When in an animal form, his eyes are concealed by thick ridges or long, hairy projections. The Reps are totally unaware of I'kok's existence, and he goes to great lengths to make sure that they do not discover him.",
                                        "{@b Motivation:} Over the centuries, I'kok has grown dependent on experiencing the fears of the Reps. If I'kok isn't able to experience the fear of the Reps at least once every hour (preferably every half hour), he weakens and dies.",
                                        "I'kok is not particularly intelligent, but he takes care not to drive the Reps to suicide, reduce them to catatonia, or scare them to death. He needs them alive for later scares. Any threat to the well-being of the Reps would not sit well with I'kok.",
                                        "{@b Powers:} I'kok has the ability to mentally shape the holomire into any shape he wishes. But he must be within 10 yards of a holomire pool or a construct and concentrate for one minute.",
                                        "I'kok's holomire constructions are seldom more complex than simple buildings, trees, and other innocuous items. These items are permanent unless I'kok destroys or alters them.",
                                        "By concentrating, I'kok can alter existing holomire creations in any way he wishes; for instance, he can cause a building to abruptly grow legs and stomp through the village, or a tree to sprout arms and grab a Rep. Controlling the holomire is I'kok's primary way of generating fear among the Reps.",
                                        "I'kok attacks with a chilling touch that drains 2-8 hp from victims; victims also take damage if they touch his flesh, but can save vs. paralyzation for half damage.",
                                        "I'kok also radiates an aura of fear at will, extending to a radius of 60 yards. The effects are similar to those of the 4th-level fear spell; victims within 0-20 yards of I'kok make their saving throws with a -10 penalty (if this penalty reduces their chance of success to 0 or less,they are automatically affected by the aura), those within 21-40 yards make their saving throws at -6, and those within 41-60 yards receive a -2 penalty.",
                                        {
                                            "type": "entries",
                                            "name": "I'Kok's Servants",
                                            "entries": [
                                                "TODO",
                                                "Reps: AC 10; MV 12; h p 5; #AT nil; Dmg nil; SD immune to all magical fear; AL N.",
                                                "The Reps are artificial life forms created by I'kok from the holomire. They are humanoid in shape, resembling men and women of all ages, with lumpy grey skin smelling of rotten fish. A Rep is hairless and featureless, except for a wide, toothless slash that nearly divides his head in half, and two small indentations that serve as eyes. A Rep has no eyeballs; his indentations provide him with rudimentary vision, and he sees his world in shadowy outlines. Reps wear crude clothes such as smocks and sack dresses, all made from the red fibres of the sajj plants.",
                                                "Unlike the creations made from the brown holomire, the Reps are capable of free action and independent thought. However, they aren't very bright (Intelligence 4) and their reactions are mostly instinctual. They are dull-witted and extremely timid; the slightest disturbance sends them screaming in fear. the Reps are completely unaware of I'kok's existence since they are immune to I'kok's fear aura, and consequently have no idea of what is happening to them or why.",
                                                "The Reps cannot attack. Their response to any threat, real or imagined, is to panic and run for cover. All types of physical attacks affect them, but they are especially vulnerable to water and other liquids; just a few drops of liquid causes them to shrink into a hard lump of mud resembling a chunk of coal. Likewise, if a Rep is reduced to 0 hp, he shrinks into a mud lump. However, a Rep never really dies; a mud lump Rep swells into his original form within a decade after his \"death.\"",
                                                "The Reps maintain a simple village on Face 1 (see below) made up of crude holomire shacks either directly provided by I'kok or made from holomire trees (also provided by I'kok). Though not strictly alive, the Reps go through the motions of eating and sleeping and carry on daily life much the same as a primitive tribe of humans."
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Entering the Room",
                                    "entries": [
                                        {
                                            "type": "inset",
                                            "name": "Read this to the players",
                                            "entries": [
                                                "The air in this gigantic room is as warm as a spring day. A gentle breeze carries the pungent odour of rotting fish.",
                                                "The room is a perfect cube; you guess it might be over two miles on a side. The side of the room from which you entered contains a small village surrounded by lush forests and large pools of brown mud. The four adjacent faces appear to be nothing more than immense shimmering mirrors. A dense jungle fills the sixth face."
                                            ]
                                        },
                                        "A crystal decahedron floats in the centre of the room. It furnishes light for the room, dimming for 12 hours, then shining for 12 hours to provide a day and night cycle. The crystal also bathes the room in a special anti-magic ray that nullifies the use of detect magic, true seeing, ESF: and similar scrying spells, as well as magical devices that duplicate these effects.",
                                        "The crystal is permanently enchanted with a wall of force, but if the PCs manage to destroy it anyway, the walls of Faces 2-5 collapse (see Encounter 2). If this happens, proceed to the Outcomes section below."
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Encounters",
                                    "entries": [
                                        {
                                            "type": "entries",
                                            "name": "Face 1: The Village",
                                            "entries": [
                                                {
                                                    "type": "inset",
                                                    "name": "Read this to the players:",
                                                    "entries": [
                                                        "A cluster of crude, brown buildings fills an area in the centre of this face about one and one-half miles in diameter. Hundreds of grey-skinned humanoids wearing red clothing mill about the village. A forest of red and silver vegetation surrounds the area."
                                                    ]
                                                },
                                                "{@b la. Entry:} the PCs entered this room here. Next to the monolithic entryway is a towering, inert Sentinel.",
                                                "{@b lb. Clearing:} These areas are relatively free of vegetation. The PCs could safely land here: there is sufficient cover, so the ship can't be seen from the village (area 1f).",
                                                "{@b 1c. Brown Pools:} These pools are 50-100 yards in diameter and are filled with brown holomire. The holomire is thick and rubbery, with an overpowering stench of rotting fish. It is dense enough to walk on (with a successful Dexterity check). The holomire is harmless, but useless to the PCs: only I'kok can mentally mould it.",
                                                "{@b 1d. Grey Pit: This is an empty pit about 50 yards in diameter and about 10 feet deep that formerly contained grey holomire. I'kok used it all to create the Reps. A few flecks of the rubbery grey substance still line the bottom of the pit. Like the brown holomire, it has the odour of rotting fish and is useless to the PCs.",
                                                "{@b le. Forest:} This forest contains hanging vines and brown holomire trees made by I'kok and used by the Reps to construct buildings. Bushes with bright red fibrous flowers are sajj plants; the Reps use the fibres to weave clothes and the stems to make \"food.\" Small colonies of silver slime in its various phases maintain the wall (see the appendix).",
                                                "{@b 1f. Village:} Dozens of brown buildings stand arranged in clusters across a barren plain of brown dirt. Most of the buildings are square, but a few have domes, and others look like crude log cabins. The buildings are an average of 20-40' wide and 10-20' high. They are featureless except for circular openings that serve as doors and windows.",
                                                "Tall, leafless trees surround the village. The buildings and trees have the texture and density of dried clay and smell of, yes, rotting fish. All are made of holomire, as is the \"dirt\" plain.",
                                                "About 2,000 Reps resembling men, women, and children crowd the village, along with many brown birds, dogs, cats, and other common animals. The Reps shuffle like zombies, some cutting down holomire trees to build more shacks, others carrying armfuls of sajj plants, still others sitting motionless on the brown ground and staring blankly into the sky.",
                                                "Some Reps operate simple spinning wheels to make clothing from the sajj fibres. Others knead sajj flowers into a pasty dough to make \"food\" for the villagers. (Reps \"eat\" by stuffing the dough in their mouths, chewing it a few times, then letting it dribble down their chins.) PCs note a lack of water and all liquids in the village.",
                                                "The Reps occasionally mumble a few low words but are usually quiet. They never leave the village, fearful of the surrounding forest and terrified of getting too close to the crystal dams (see Encounter 2).",
                                                "I'kok, in the form of a Rep, also dwells here, constantly terrorizing the villagers (see the Random Encounter section below). The Reps are completely unaware of his presence. I'kok can mentally control the holomire buildings, trees, animals, and ground from anywhere in the village.",
                                                "To stay healthy, I'kok must experience the fear of a Rep at least once per hour; he must be within 100 feet of a terrified Rep to receive full benefits from this \"fix\" of fear. Because the Reps are vital to his existence, I'kok is careful not to kill them, though he makes occasional exceptions when inspired to a particularly terrifying effect.",
                                                "If the PCs fly their ship over the village, the Reps panic, running in every direction while shrieking at the top of their lungs, diving into random buildings to hide. These reactions continue as long as the Reps can see the ship. I'kok also sees it, thus becoming aware of the PCs; see the Random Encounters section below.",
                                                "If the PCs explore on foot, the Reps react to them by shrieking, running, and hiding. If the PCs corner one of them, the Rep trembles and cries until he faints from fright; the PCs cannot talk with a Rep. If the PCs explore less openly, they can observe the Reps undetected. Plenty of trees and buildings provide cover.",
                                                "Unless the PCs have been alerted to I'kok's existence, it is unlikely that they can distinguish him from the other villagers. However, if they somehow manage to expose I'kok, go to the Outcomes section.",
                                                "{@b Random Encounters:} the more time the PCs spend in the village, the more bizarre phenomena they observe. I'kok creates these to terrorize the Reps. If I'kok becomes aware of the PCs, he directs some of these incidents to them; I'kok would love to experience the fear of humans again.",
                                                "Whenever the action slows down while the PCs are in the village, they either observe an incident or experience one themselves. Feel free to change the frequency of the incidents, select particular ones, or make up new ones. In no case does I'kok create an incident that draws attention to himself. Only occasionally does he create one that inflicts damage: his main intention is to scare his victims. Treat all attacks as 5 HD monster attacks (one attack per round, and 1d4 hp damage).",
                                                "Use imagination in creating incidents. Aim for the grotesque and creepy. Some suggestions:",
                                                {
                                                    "type": "list",
                                                    "items": [
                                                        "A 10' tentacle springs from the ground, a tree, or a building and rapidly wraps itself around a character's throat. The tentacle makes a quick squeeze, then disappears (no damage).",
                                                        "A giant hand erupts from the ground, a tree trunk, or a wall. It slaps a PC to the ground (Dexterity Check to avoid being knocked down).",
                                                        "A building suddenly sprouts 2d4 long legs and stomps through the village at a rate of 36\". It kicks at random characters before resuming its normal shape. Each stomp inflicts 1d4 damage.",
                                                        "A monstrous face suddenly appears on the side of a building, a tree trunk, or on the ground. The face screams loudly at a character, then disappears.",
                                                        "A tree drops its branches, its top forms into a razor-sharp point, and it dives for the nearest crystal dam (see Encounter 2). The tree swerves at the last moment, missing the dam, then turns to dust. Since the Reps live in fear that a dam will break, this is particularly terrifying.",
                                                        "A brown Rep in the shape of a child or adult suddenly explodes. This isn't a real Rep (note the colour), but a fake created by I'kok. The explosion causes no damage.",
                                                        "A chicken or other common animal made of brown holomire suddenly attacks a random PC. Its head swells to a n enormous size (1O' wide or more) as it snaps at its victim. Then the animal disappears."
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "type": "entries",
                                            "name": "Face 2-5: Crystal Dams",
                                            "entries": [
                                                {
                                                    "type": "inset",
                                                    "name": "When the PCs approach Face 2, 3, 4, or 5, read the following:",
                                                    "entries": [
                                                        "A clear crystal resembling a gigantic window covers this entire face. The roar of a raging ocean grows louder as you approach. Surging waves of greenish water constantly splatter against the crystal, as if trying to burst free."
                                                    ]
                                                },
                                                "The crystal serves as an immense dam, restraining millions of gallons of raging ocean: it is as if the crystal is one side of an immense aquarium, about half-filled with water. The Arcane created these dams to strike terror into any sentient creature on Face 1. This happens because the gravity here differs from the other rooms of the Hive. Instead of pulling down, gravity pulls toward Face 1; if the crystal breaks, water spills down on that face.",
                                                "The crystal is AC 4. If the crystal suffers 25 hp of damage, a crack appears that gradually widens from the pressure of the water inside. Within 30 minutes, the crack runs the length of the crystal, and all of the water spills out over Face 1 (this takes about 15 minutes). There is enough water behind the face to fill the room to a depth of about 1,000 feet; therefore, the water behind all four crystal dams would fill the room to about 4,000 feet.",
                                                "If the PCs instigate such a flooding, proceed to the Outcomes section below."
                                            ]
                                        },
                                        {
                                            "type": "entries",
                                            "name": "Face 6: Ceiling Forest",
                                            "entries": [
                                                {
                                                    "type": "inset",
                                                    "name": "Read the following:",
                                                    "entries": [
                                                        "A dense forest of thick red, green, and silver vegetation fills the entire face. Vines and gangly tree limbs hang down, as though reaching for the village miles below. Even if the gravity would enable you to land here, there is no clearing large enough to land a ship, and penetrating the hanging gardens on foot appears to be impossible."
                                                    ]
                                                },
                                                "PCs must use flight or cling tightly to the vines to avoid a long, long fall to the village below. Exploration of the forest turns up silver slimes, sajj plants, a variety of exotic plant life of no particular interest, and absolutely nothing of use to the PCs.",
                                                "However, if they hide and wait for 1d6 hours, I'kok transforms into a balloon-like creature and floats upward toward the hanging trees. He comes here to harvest fresh sajj for the Reps, since they cannot climb the slick walls of the dams. This is one good way of flushing out I'kok, though it requires patient PCs."
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Outcomes",
                                    "entries": [
                                        "There are several possible outcomes to the PCs' adventures in this room:",
                                        "{@b PCs leave before confronting I'kok:} Even if the PCs learn about I'kok, they may decide it's not worth the trouble to confront him. Or the PCs may not know how to expose him. I'kok's power remains undiminished, and the Ravager can use its fear eye in the adventure's climax (see Chapter 6).",
                                        "{@b PCs uncover I'kok's identity:} If his identity is revealed, I'kok tries to escape, losing himself in the crowd or polymorphing into a digging creature to burrow into the ground or into a bird to disappear into the forest (area le). If the PCs catch him, I'kok fights to the death, shaping the holomire into giant fists and tentacles to attack the PCs.",
                                        "{@b PCs attack the village:} If the PCs deduce that the Reps are the source of I'kok's power, they may try to destroy as many of the Reps as possible. This is fine with I'kok; the PCs' spree of destruction terrifies the Reps.",
                                        "However, if the PCs slaughter more than half the population, I'kok reveals himself and attacks, continuing until death or until the PCs retreat (then he tries to hide again in the village).",
                                        "{@b PCs break open one or more crystal dams:} This is the best way to flush out I'kok and destroy the Reps. Within minutes, the entire village is flooded and all of the Reps are reduced to mud lumps.",
                                        "The panicky I'kok flies to the nearest broken dam and immediately forms the holomire into dozens of tentacles hundreds of feet long. Each tentacle has a paddle on the end. I'kok orders the tentacles to hold the ripped dam together and scoop the water back inside. It's a totally futile effort.",
                                        "If the PCs approach I'kok, he attacks them, but he is panicked and distracted, his concentration focused on holding the dam together. The PCs can continue to attack if they wish; otherwise, I'kok succumbs to an anxiety attack and plummets into the water, sinking to the bottom. A few moments later, the withered and destroyed beholder eye floats to the surface.",
                                        "During the next few months, the water will subside, and the Reps will reform and start a new colony. But I'kok is gone."
                                    ]
                                }
                            ]
                        },
                        {
                            "type": "section",
                            "name": "Room 9 - Shell Game",
                            "entries": [
                                "This room is the domain of the Queen's Eye Incarnation representing the beholder's slow power.",
                                {
                                    "type": "entries",
                                    "name": "Incarnation",
                                    "entries": [
                                        "TODO",
                                        "Grull-Ghohruh: AC 8; MV 3; HD 12;hp 70; #AT 1; Dmg 1-12;SA breath causes victims to slow; A L CE; THACO 9.",
                                        "{@b Appearance:} Grull-Ghohruh is a giant slug, 150 feet long and nearly 40 feet thick, with pale grey skin whose texture resembles gelatin. He has two 30' antennae that hang limply over his featureless face. Rows of razor-edged teeth line his lipless mouth.",
                                        "Grull-Ghohruh has no eyes, but he can sense movement and body heat up to one mile away; so acute are these senses that he can determine an intruder's physical form, his precise location, and an approximation of his actions. For example, if a man with a long sword was approaching, Grull-Ghohruh would be able to detect the presence of a humanoid form with a bladed object; Grull-Ghohruh would also know the man's exact location and every movement.",
                                        "{@b Personality:} Grull-Ghohruh lives in the centre of an immense spiral-shaped seashell that drifts aimlessly beneath the surface of the faces of his room (see \"Entering the Room,\" below). Centuries of inactivity have left him a virtual invalid. Every movement requires enormous effort, so Grull-Ghohruh does little more than lie on his belly and sift the water that washes through his teeth for nutrients.",
                                        "{@b Motivation:| The passage of time has dulled Grull-Ghohruh's mind (his Intelligence is now 4). Whatever plans and aspirations he once had are now only vague memories that are too much trouble to act upon.",
                                        "He once had a grand plan to surround himself with intelligent creatures who shared his outlook and affinity for sluggishness, but he lacked the ambition to recruit them and the imagination to lure them. A few acceptable creatures dwell with him in his shell, but these are little more than dumb animals left for his amusement by the Arcane.",
                                        "In all the years he's been here, Grull-Ghohruh has managed to acquire and corrupt only one group of intelligent creatures and transform them into his own image. About 300 years ago, a band of nixies arrived in the room, the only survivors of the Ravager's attack on their spaceborne home. The nixies intended to begin a colony on one of the room's faces.",
                                        "In those days, Grull-Ghohruh had enough energy to put the nixies to sleep. Then he stole their life forces and transformed them into slug-forms (see below). It would greatly please Grull-Ghohruh to add to his collection of intelligent subjects, but since the arrival of the nixies, no other likely prospects have ventured into his room.",
                                        "{@b Powers:} Grull-Ghohruh isn't much of a fighter. His muscles have all but atrophied, and he can do little more than drag his bulk around in a slow crawl. He can bite for ld12 hp damage if a victim comes close enough.",
                                        "Three times per day, Grull-Ghohruh can breathe a cloud of green mist 50' in diameter. Anyone contacted by this cloud is subject to the effect of a slow spell. Those affected move at half their normal rate. take an AC penalty of +4, take a THACO penalty of -4, and all Dexterity combat bonuses are negated. The effect persists for 1-4 turns. To avoid this effect, the victim must save vs. poison at a -4 penalty.",
                                        "Grull-Ghohruh can mentally control his seashell to move anywhere he wants, but it's too much work. He'd rather lie back and let the shell drift.",
                                        "{@b Identifying Quote:} None. Talking is too much work."
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Entering the Room",
                                    "entries": [
                                        "The faces of this room measure over two miles per side. Each is a slimy, turgid ocean of yellow-green water, 400 feet deep and covered with moss. Dozens of oblong grey islands, each about 150 feet long and 20 feet wide, drift in the oceans. The islands are barren, but glisten as if covered with slime.",
                                        "The PCs enter the room through the hole (area la) on Face 1. Inside this entryway is a towering, inert Sentinel.",
                                        "The crystal decahedron in the centre of the room continually bathes the room in amber light, like a perpetual sunset. The crystal also emits a special anti-magic ray that nullifies the use of dispel magic and similar spells. The crystal is permanently enchanted with a wall of force,but if the PCs manage to destroy the crystal, the room is plunged into darkness.",
                                        "The ocean smells like burning wood. Aside from its odour and colour, it is normal water. The PCs can swim in it, and although it tastes bitter, they can drink it without harm.",
                                        {
                                            "type": "entries",
                                            "name": "Strange Islands",
                                            "entries": [
                                                "The islands are actually the transformed nixies. They are now featureless, slug-like creatures existing in a state of temporal stasis. Use the same statistics as Grull-Ghohruh, except the transformed nixies have no slow power, and are AL N.",
                                                "The islands/nixies are covered in cold grey slime, a thin gelatin that smells like wet tobacco. There are no obvious signs that the islands are alive. Even if the PCs figure out that they're actually living creatures, the slug-nixies are incapable of normal communication.",
                                                "If a PC remains in physical contact with an island for a full minute, such as by standing on or touching it, he hears a single word in his head: HELP. The proximity to another intelligent being stimulates the nixie sufficiently for limited mental communication.",
                                                "If the same PC remains in contact for a second minute, he hears another word, US; a third minute, OPEN: a fourth minute, BLACK; and a fifth minute, SHELL.",
                                                "If the PC continues to touch the nixie, the message repeats itself, one word per minute. If the PC breaks contact, then resumes, the message starts again from the beginning.",
                                                "All nixies broadcast only this message, actually two sentences: HELP US and OPEN BLACK SHELL. They are trying to tell the PCs to open the black shell containing their spirits. See \"The Chamber of Grull-Ghohruh:\" below."
                                            ]
                                        },
                                        {
                                            "type": "entries",
                                            "name": "Looking for Grull-Ghohruh",
                                            "entries": [
                                                "No black shell is visible on the surface of any wall's ocean. If the PCs have some method of surviving underwater, let them take the search into the foetid, slimy waters. There, pit them against Grull-Ghohruh's servants in one or two random encounters. These servants are listed later.",
                                                "Only slime is found on the floors of the oceans. The area is so huge that the PCs would have little chance of finding Grull-Ghohruh's lair, if not for the fact that he is also searching for them. While the PCs are underwater, the shell looms beneath them, then launches to the surface with them on top of it! Go to the next section."
                                            ]
                                        },
                                        {
                                            "type": "entries",
                                            "name": "Grull-Ghohruh Arrives",
                                            "entries": [
                                                "Use this option if the PCs have no way to survive underwater.",
                                                "About 30 minutes after the PCs enter the room, the waters on Face 6 surge. An immense seashell suddenly crashes through the waves and settles on the surface. The spiral-shaped shell is nearly 700' in diameter and about 7O' thick. It appears to be smooth, pink stone. Its sides glisten with a grey gelatin like that on the islands.",
                                                "Near the base of the sea shell, just above the surface of the ocean, is a circular opening about 20' in diameter. A rush of water abruptly spews from the opening, as if the shell were emptying itself of liquid. The water spews for several minutes, then dwindles to a trickle before stopping completely.",
                                                "The seashell is the home of Grull-Ghohruh. He detected the PCs and has risen to greet them. He hopes the PCs will explore his shell, so he can turn them into slugs."
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Into the Shell",
                                    "entries": [
                                        "The interior of the shell is a spiralling cylinder about 70' in diameter; the total length to the central chamber is about 5000'. The interior is pitch black. About three feet of standing water remain in the shell.",
                                        "The walls have 30 hp; inflicting that much damage creates a breach wide enough for one PC to pass. This cuts the length of the journey by a variable amount (ld100x10 feet on the outer turns of the spiral, ldlOOx5 or 1d100 feet further inward). But it certainly attracts Grull-Ghohruh's minions, who roam inside the shell.",
                                        "Grull-Ghohruh has ordered his servants to kill the PCs and bring their bodies to his quarters (see below). There, he'll store their spirits in a black seashell and transform the bodies into slug creatures.",
                                        "Once they are transformed, Grull-Ghohruh will expel the PC/slugs into the ocean where they will grow in size, becoming identical to the nixie/slugs in about one year. If the surviving PCs locate Grull-Ghohruh's chamber, defeat him, and open the black shell, the spirits of any \"killed\" PCs are freed and return to their bodies; the PCs revive with all of their hp intact.",
                                        "{@b Random Encounters:} As the PCs explore the shell, roll ld6 every turn. If the roll is 1 or 2, roll ld6 and consult the table below for a random encounter with Grull-Ghohruh's minions. All minions were normal creatures at one time, but the Arcane modified them as follows:",
                                        {
                                            "type": "list",
                                            "items": [
                                                "They are covered with grey slime. This slows their physiological functions to such an extent that they can live for thousands of years. It also allows them to breathe water as well as air. (This slime has no effect on PCs or outside this room.)",
                                                "They react very slowly. They have an attack penalty of -2, their movement rates have been reduced as indicated, and their opponents always have initiative.",
                                                "They no longer have wills of their own, and they fight to the death for Grull-Ghohruh, pursuing if necessary."
                                            ]
                                        },
                                        {
                                            "type": "entries",
                                            "name": "Minion Encounters",
                                            "entries": [
                                                "TODO:",
                                                "1. Modified Giant Leech(1-4): AC 9; MV 1, Sw 2; HD 3; hp 18 each; #AT 1; Dmg 1-4;SA drain blood (lose 1 hp per HDof leech per round as long as leech is attached; anaesthetizing saliva usually prevents bite and blood drain from being felt until victim has lost 50% of hp); A L N;THACO 18(reduced from 16).",
                                                "2. Modified Aquatic Constrictor (snake): AC 5; MV 3; HD 6 + 1; hp 38; #AT 2; Dmg 1-4/2-8; SA constriction; A L N;THACO 79 (reduced from 17).",
                                                "3. ModifiedGiant Crab: AC 3; MV 3; HD3; hp22; #AT2; Dmg 2-8/2-8;A L N; THACO 18(reduced from 16).",
                                                "4. Modified Giant Crayfish: AC 4; MV 2, Sw 3; HD 4+4; hp 27; #AT 2; Dmg 2-12/2-12; A L N; THACO 17 (reduced from 15).",
                                                "5. Modified Giant Pike: AC 5; MV Sw 12; HD 4; hp 30; #AT 1; Dmg 4-16; A L N; THACO 17 (reduced from 15).",
                                                "6.Modified Marine Eel: AC 6;MV Sw 3; HD 6;hp 40; #AT 1; Drng2-8; SA electric shock at a 15-foot range (victims less than five feet away suffer 6-36 hp of damage, all others suffer 2-12 hp of damage; shocked victims must save vs. paralyzation or be stunned for a number of rounds equal to the damage sustained by the electric shock; victims 5-1O'away get a + 1 bonus to their saving throw; victims 11-15'away get a +2 bonus); A L N; THACO 15 (reduced from 13)."
                                            ]
                                        },
                                        {
                                            "type": "entries",
                                            "name": "The Chamber of Grull-Ghohruh",
                                            "entries": [
                                                "At the centre of the shell lies a circular chamber 100' wide. It looks smooth and curved, as one would expect a shell's centre to look. Its resident is not so conventional.",
                                                "Grull-Ghohruh is fully aware of the PCs' approach. He is coiled around a 30' diameter black seashell resembling a clam. This shell contains the spirits of the nixies (as well as the spirits of PCs that Grull-Ghohruh's minions have killed). The shell is completely concealed beneath his coils.",
                                                "Grull-Ghohruh attacks the PCs with his three slow clouds at the earliest opportunity, but he does not leave the black shell; he hopes the PCs will eventually give up and leave his chamber, giving his minions another chance at them.",
                                                "If Grull-Ghohruh loses half his hit points, or if the PCs seem to be on the verge of discovering the shell, he uncoils, exposing the shell, and attacks random PCs with his bite. Once Grull-Ghohruh uncoils, one or more of his minions appears every 2d4 rounds thereafter (roll on the Random Encounter table or choose specific minions). If the PCs leave the chamber, the minions pursue. However, Grull-Ghohruh does not leave his chamber.",
                                                "The black seashell has AC 0. If it suffers 25 hp of damage, it cracks open. A blur of ghostly figures streams from the shell, vanishing through the walls of the chamber an instant later. These are the spirits of the nixies, on their way to reunite with their physical bodies."
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Return of the Nixies",
                                    "entries": [
                                        "If the PCs crack open the black shell, the freed spirits fly directly to the nixie/islands. The moment they make contact, the nixies return to their original forms, their memories, minds, and hit points intact.",
                                        "TODO",
                                        "Nixies (8O): AC 7; MV 6, Sw 12; HD 1-4 hp; #AT 1; Dmg by weapon; SA charm; AL N; THACO 20.",
                                        "The nixies appreciate the PCs' efforts, but they want to leave. It takes the transformed nixies about an hour to get their bearings and make sure all of their companions are accounted for. During this time, the PCs can speak with them.",
                                        "The nixies can tell the PCs what happened to them, but they have no other relevant information, aside from one important detail about Room 11: \"There are pods shaped like bells at the entrance,\" they say. \"Rub the syrup on your bodies, or the undead will kill you.\"",
                                        "The nixies won't elaborate. This is second-hand information: they haven't actually been to Room 11 themselves. The nixies have no other information for the PCs.",
                                        "The nixie band then heads for the tunnel, whether or not the PCs want to take them there. A few may be willing to join the PCs, or can even become replacement PCs in a pinch.",
                                        "Optionally, to avoid the logistics of a rescue mission or the potential unbalancing factor of 80 additional NPCs, assume that each nixie has bought from the Arcane a special belt that allows them to teleport without error to get home, wherever that is. These belts function only for nixies."
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Troubleshooting",
                                    "entries": [
                                        "{@b PCs don't contact the islands/nixies to hear their message:} The PCs hear vague, indecipherable messages when they near an, island, growing louder as they get closer. That should tempt them.",
                                        "{@b PCs hesitate to explore the giant seashell:} Add another sentence to the island/nixies' message, such as IN BIG SHELL.",
                                        "There is no penalty if the PCs don't help the nixies: they simply won't get the clue about Room 11, and they probably won't learn exactly what's been going on in Room 9."
                                    ]
                                }
                            ]
                        },
                        {
                            "type": "section",
                            "name": "Room 10 - The Gnarled, Bad Caverns",
                            "entries": [
                                "This room holds the Queen's Eye Incarnation representing the beholder's cause serious wounds power.",
                                {
                                    "type": "entries",
                                    "name": "Background",
                                    "entries": [
                                        "The makers of the Hive built this room well. Despite the destruction of the Sazaur nation and the ravages of time, this chamber has functioned perfectly, swallowing up all who enter it and letting none, except the silver slimes, escape.",
                                        "The Sazaur filled this chamber with incalculable tons of sharp-edged obsidian stone. Then the Arcane enchanted it with powerful magic. All the obsidian combined to form a single being, a construct called Valkor.",
                                        "Valkor may be this crystal sphere's largest obsidian golem, or at least half of it. From head to waist, he is roughly human-shaped, like most other golems. But he is 40' tall: if he were fully human-shaped, he'd stand 80' tall. He is attached at the waist to the obsidian that makes up most of this chamber. He controls the stone; he knows everything that is within it, and can make it move, slowly and imperceptibly.",
                                        "In this chamber, the Sazaur released piercers, the stalactite-shaped creatures that cling to cave roofs and drop to impale people beneath (Monstrous Compendium, Volume One). Piercers are adept at natural camouflage, and those in this chamber have taken on the colour and texture of obsidian.",
                                        "By inflicting damage on victims gradually, with sharp obsidian surfaces and piercers, Valkor simulates the damage done by cause serious wounds spells and brings magical power to himself.",
                                        "Those who survive as far as the room's central chamber are usually ragged, bloody messes, and Valkor has no problem defeating them with his upper body."
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Entering the Room",
                                    "entries": [
                                        "The exit from the tunnel is open, but unlike many other tunnels, no light shines out from it. It is utterly dark and silent within. The characters must light their way with torches and the ship's lamps to continue.",
                                        "The light cast by the torches and lamps reveals a new tunnel, as big around as the current one, but formed from blackish, sharp-edged stone: obsidian. The tunnel stretches farther than the light cast by the torches.",
                                        "Detect magic indicates strong magic in this chamber. (It is a clue that characters can detect magic through all this stone: stone as thick as this should block the spell. Therefore, the stone itself is magical. Don't tell the player if he doesn't realize it himself.) The casting character cannot determine the sphere or type of magic, because it is alien to the PCs.",
                                        "The characters require about one hour to travel the winding, twisting caverns. Once every 15 minutes, they suffer one of the types of encounters described in Events 1 and 2. If they are still alive and mobile after one hour, they emerge into Valkor's central chamber."
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Walls Like Knives",
                                    "entries": [
                                        "The ship has no problems manoeuvring into the hole or sailing down the first stretch of the tunnel. The tunnel walls look wicked; the PCs know they wouldn't like to walk along them. But they should believe it safe to float along the middle of the tunnel.",
                                        "After the first bend in the tunnel, once the characters are out of sight of the room's entrance, play these incidents, one by one:",
                                        "{@b 1. Scraping bottom:} The PCs hear something scraping along the bottom of the keel, from bow to stern. When they look over the rail, they see that a large chunk of obsidian, shaped like a stalagmite, has scraped at the ship's hull, scarring the wood.",
                                        "The lookout in the bow can swear that no such obstacle existed ahead in the tunnel. It must have just appeared. While the PCs watch it, that stalagmite does not move or do anything unusual.",
                                        "{@b 2. Narrow passage:} At another bend in the tunnel, the PC who is standing nearest a rail receives a 2d8+1 wound to his side nearest the wall. He didn't see it coming. When he looks, he sees that the ship has passed too close to the wall, and a spiky projection of obsidian hit him. While he watches that projection, it does nothing unusual.",
                                        "If someone attacks it, he's attacking a hunk of rock; it demonstrates no magic or movement abilities, and they may destroy it. They may also destroy their own weapons by hammering at it.",
                                        "{@b 3. Gravitational swings:} At some point while sailing along, the ship abruptly lists sharply to port. This brings the port side of the ship dangerously close to the walls. The tops of the masts graze the side of the tunnel and the whole ship shudders. A random NPC screams and falls over the rail; he hits the wall, is cut to ribbons, and dies before he slides to a halt at the bottom of the tunnel.",
                                        "Before the ship's unexpected manoeuvre is done, it has rotated 90 degrees to port. It is obvious to the characters that they've entered an area of the chamber where gravity comes from a new direction, and the ship just righted itself naturally. This is a new menace the characters may have to face from time to time.",
                                        "These three events are \"filler\" encounters. The more dangerous moments are still ahead. But the DM can repeat any of these events if the adventure begins to drag, both now and during the upcoming stretches of the characters' progress."
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Visitors Drop In",
                                    "entries": [
                                        "The ship passes through a larger chamber, large enough to turn the ship around and loaded with stalactites above and stalactites (not stalagmites; these are pointed) below.",
                                        "Two piercers in the ceiling drop down upon the ship. Ask every character (including NPCs) to roll ld20: the two lowest rollers are attacked.",
                                        "TODO",
                                        "Obsidian-Coloured Piercers: AC 3; MV 1; HD 3; hp 15: #AT 1; Dmg 3-18; SA surprise: AL N: THACO 17; 4 1/2' long.",
                                        "After this initial encounter, the piercers continue to plague the characters.",
                                        "DM Note: Not all piercers cluster among stalactites in larger caverns. Some creep into flues and fissures at the top of tunnels and drop like darts out of a blowgun at their targets. In such cases, only one piercer attacks at a time."
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Valkor",
                                    "entries": [
                                        "After an hour of sailing (and at least four damaging encounters of the types described above), the PCs enter the central cavern of this room.",
                                        {
                                            "type": "inset",
                                            "name": "Read this description:",
                                            "entries": [
                                                "Up ahead, the tunnel is lit. It turns to starboard, and you can tell that there is a bright light around the turn. You can extinguish your torches and lamps if you wish; the tunnel is bright enough to see without them.",
                                                "You sail around the bend into dazzling light. The tunnel opens up into a much larger cavern.",
                                                "The cavern is cubical, 100 yards on a side. Like the rest of this cavern system, its walls are obsidian. In the exact centre of the cavern is the glowing crystal sphere providing the illumination.",
                                                "Below the sphere is something that looks like a huge obsidian statue of a handsome man. It's 40 feet tall from head to waist, and the waist is the statue's base. The legless statue is carved from obsidian, with sharp corners everywhere. It shows a man with crossed arms and a curious expression on his face. A beholder's eye is affixed to his forehead.",
                                                "The statue moves. With a noise of grinding rock it uncrosses its arms. looks at you on the deck, and speaks. Its voice is a hollow roar, like a high wind in a deep cavern: \"Greetings, doomed champions. I congratulate you. Few mortals ever last long enough to see me. I imagine the ship helped you. But now, prepare for slow and painful death.\""
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Incarnation",
                                    "entries": [
                                        "TODO",
                                        "Valkor: AC 0; MV 0; F 12: HD 10: hp 60; #AT 2; Dmg 2-16+1/2-16+1 or special; SA, SD see below: AL LE; THACO 10.",
                                        "{@b Appearance:} As described above.",
                                        "{@b Powers:} Valkor can use these spell-like abilities: spell immunity (unlimited, as the 4th-level priest spell) to stone to flesh and lightning bolt spells.",
                                        "{@b Personality:} Valkor is the golem equivalent of a little boy who loves to dissect frogs to see how they work. He's very calm and curious. He inflicts agonizing pain because it is his nature, but he tries to learn from it: he is especially interested in how flesh and blood creatures function.",
                                        "Valkor speaks to the characters throughout the fight, talking about his scientific curiosity, analysing their performance in getting to the chamber, and so forth.",
                                        "{@b Motivation:} Valkor knows what he must do to survive; he must inflict agony and kill all visitors by inches, the better to support the cause serious wounds magic of this room. Accepting that, he looks on his actions as an art form. He inflicts agony artistically. He tries to make the injuries decorative as well as functional. For instance, he may try to spell out his name on the Skyrunner hull with scraping damage (see below).",
                                        "{@b Identifying Quote:} \"You should feel honoured. Live, and you are but mortals. Die at my hands, and you are Art.\"",
                                        {
                                            "type": "entries",
                                            "name": "Fighting Valkor",
                                            "entries": [
                                                "Valkor can strike with both his sharp, pointy hands each round. They do 2d8+1 damage each, exactly the same as a cause serious wounds spell.",
                                                "In lieu of any strike, he can swing his arm and hurl small, dart-like obsidian chips at distant enemies. These flying obsidian darts also do 2d8+1 damage at a maximum range of 30 yards (-1 THACO penalty per 10 yards of range).",
                                                "On any round, Valkor can forego normal attacks and instead make one special attack. With both fists, he strikes the ground. Pieces of sharp obsidian rain down on the entire chamber. This shower hits every character (except those below deck in the ship)for 1d4 damage. Unless a character is within 10' of a surface he can duck beneath, no evasion is possible. If a character succeeds in a Dexterity check to leap under the surface, he takes no damage.",
                                                "If Valkor is brought to 0 hp, he looks down at his shattered body and says, \"How interesting. Something new to experience.\" Then he collapses into a million pieces of stone. The beholder's eye drops out of his forehead and shatters on the floor of the cavern."
                                            ]
                                        },
                                        {
                                            "type": "entries",
                                            "name": "Aftermath",
                                            "entries": [
                                                "After Valkor's death, there is a great rumbling in the ground, and the tunnel beyond this cavern's exit writhes and twists. It is now a straight shaft that heads directly to the tunnel out of the room.",
                                                "The caverns are now still: no sharp projections or rocks appear to harm the ship. The piercers are so alarmed by this commotion that they do not attack the characters as they depart.",
                                                "The cavern's \"sun\" crystal exhibits no unusual behaviour after Valkor's death."
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Troubleshooting",
                                    "entries": [
                                        "{@b PCs try to escape before confronting Valkor:} This won't work. When the PCs try to return the way they came, the tunnels don't look familiar. They twist around in different directions. And all paths lead to Valkor's chamber.",
                                        "{@b PCs fall against the wall or to the floor:} A PC hitting the wall takes four separate attacks as, he slides to the ground. Each successful attack (THACO 20) inflicts 2d8+1 damage from the sharp obsidian edges. Note that the heavier a character's armour, the likelier it is he reaches the ground intact.",
                                        "Once on the ground, the PC takes no damage from walking in heavy leather boots: in lighter footwear, he suffers 1 hp damage per round. Barefoot PCs suffer 2 hp damage per round."
                                    ]
                                }
                            ]
                        },
                        {
                            "type": "section",
                            "name": "Room 11 - Dead Air",
                            "entries": [
                                "This room is the domain of the Queen's Eye Incarnation representing the beholder's death ray power.",
                                {
                                    "type": "entries",
                                    "name": "Background",
                                    "entries": [
                                        "Room 11 was used as a cemetery for the beholders who died of natural causes back when the Hive was under construction. This room's Incarnation, Xuu, is the caretaker, a job he takes seriously.",
                                        "As part of their funeral customs, the beholders smooth a special blood-red salve over the bodies of their deceased comrades. The salve hardens into a tough, leathery shell that supposedly keeps the dead beholder's spirit contained and protected. (These beholders have no concept of an afterlife: instead, they believe their spirits remain asleep in their bodies, dreaming pleasant dreams for all eternity.)",
                                        "This room is filled with the corpses of beholders encased in these blood-red shells. The corpses of commoners and workers are set out on Face 3, while the corpses of the beholder aristocracy reside in a special mausoleum on Face 6 (see the Encounters section below).",
                                        "Within the last century, Xuu has noticed that some of the corpses' shells have begun to crack and chip. Xuu has dutifully patched them: there's plenty of red salve in the room for this purpose. But Xuu considers this to be menial work, beneath his dignity: after all, he's a supervisor, not a mere worker. He's ordered some of the undead that roam this room to take care of the 'repairs, but they do a sloppy job and Xuu invariably has to finish the job. Xuu longs for an intelligent creature to join him in the room and take charge of making the repairs."
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Incarnation",
                                    "entries": [
                                        "TODO:",
                                        "Xuu: AC 4: M V 12, FI 24 (B): HD 6: hp 42: #AT 1: Dmg 1-6: SA energy drain: enveloping a victim causes death unless negated by save vs. death magic: SD vaporous form: immune to sleep, charm, hold, death, and cold based spells, as well as raise dead: hit only by silver or +1 or better magical weapons: AL LE: THACO 15.",
                                        "{@b Appearance:} Xuu exists in two forms and can change between these forms at will. His primary form resembles that of a wraith, a blue cloud vaguely shaped like a 30-foot diameter beholder with glowing red eyes. As with wraiths, Xuu has no true substance. All of the statistics given above apply to Xuu in this form. He has Intelligence 7.",
                                        "Xuu can also take the form of a thin, shapeless blue vapour about 2 1/2 miles in diameter, nearly large enough to fill Room 11 entirely. Xuu can't attack or be attacked in this form, nor does he have any control over his movement: he isn't able to do much but drift from place to place. However, he retains his consciousness and all of his senses in this form, enabling him to monitor all of the activity in his domain.",
                                        "{@b Motivation:} Find a job replacement: see above.",
                                        "{@b Powers:} In his wraith form, Xuu attacks with a chilling touch. Any victim he completely envelops for one full round must succeed in a saving throw vs. death magic or die. He can only envelop one victim at a time. Xuu can't attack in his mist form, but he is also immune to all attacks.",
                                        "{@b Identifying Quote:} See below."
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Entering the Room",
                                    "entries": [
                                        {
                                            "type": "inset",
                                            "name": "Read this to the players:",
                                            "entries": [
                                                "This is a colossal cube, so large you can hardly see it all. It may measure over two miles on a side. A thin blue mist floats through the grey sky of this room. The air is cool and still. All is darkness and shadows.",
                                                "The wall you entered is a bleak landscape of grey ash and hundreds, maybe thousands of corpses arranged in huge runic symbols. Some of the corpses are active, stumbling aimlessly across the landscape.",
                                                "The adjacent walls are similarly bleak: one is identical to the first, another is filled with grey mud, a third contains hundreds of immobile globes the colour of blood, and the fourth is a featureless black plane, as smooth as glass. The sixth wall, directly overhead, looks like this one, except that an immense pyramid of glowing red stone stands in the centre of the wall.",
                                                "No sooner do you get your bearings, than you hear a soft, pleading voice in your heads: \"Come to the light... come to the light....\""
                                            ]
                                        },
                                        "The voice belongs to Xuu, who tries to lure the PCs to the glowing red pyramid. There, he intends to recruit them, voluntarily or otherwise, as his assistants in the beholder cemetery. The voice repeats the message for about a minute, then fades.",
                                        "A black crystal decahedron floats in the centre of the room. The crystal produces a continuous, dull blue light for the room and also nourishes the undead who dwell here. It bathes the room in a special anti-magic ray that nullifies the use of protection from evil, invisibility to undead, hold undead, control undead, and similar spells, as well as any magical devices that duplicate these effects. The crystal is permanently enchanted with a wall of force, but if the PCs manage to destroy it, the room is plunged into darkness.",
                                        "Next to the entryway is a towering, inert Sentinel.",
                                        {
                                            "type": "entries",
                                            "name": "Garlic Soup",
                                            "entries": [
                                                "Surrounding the entryway are tangles of leathery, black vines about ten feet thick. Bell-shaped white pods five feet long grow thickly from the vines. The pods and vines smell like garlic.",
                                                "The beholders used these plants to fend off the undead, preventing them from interfering with funeral rituals. The odour of the plants keeps most of the undead docile and harmless.",
                                                "The PCs may have heard about these bell-pods if they rescued the nixies in Room 9. The bell-pods open easily; each contains a thick syrup, milky-white in colour, that the PCs can rub on their bodies (as suggested by the nixies).",
                                                "None of the undead listed in the Random Encounters section below comes near a PC with the bell-pod syrup on his body. If such an encounter is indicated, the undead approach the PCs, are repulsed by the syrup, then stumble away. The beholder zombies on Face 2 and in the mausoleum on Face 6 are similarly affected.",
                                                "Xuu, however, is not affected. Also, once the syrup is removed from a bell-pod, it loses its potency in one hour. If they like, the PCs can return to the entrance area to get more syrup. The syrup soon loses its potency if removed from this room."
                                            ]
                                        },
                                        {
                                            "type": "entries",
                                            "name": "Random Encounters",
                                            "entries": [
                                                "The PCs can explore any of the walls. Also, for every 30 minutes spent in the room, roll ld6. On a roll of 1-2, a random encounter occurs; roll ld6 again and consult the following table. Feel free to alter the frequency of random encounters or to choose specific encounters from the table.",
                                                "Some of the encounters can only occur if the PCs are exploring the room on foot; if they aren't, roll for another encounter or treat the result as no encounter. Note that random encounters do not occur in encounter areas 3 and 4 (Faces 4 and 5).",
                                                "All the undead are extremely vicious and will fight to the death, pursuing if necessary. They normally receive their nourishment from the central crystal, but they would welcome the chance to feast on the PCs.",
                                                "{@b Random Encounters:}",
                                                "{@b 1-2 Voice:} All PCs hear a soft, pleading voice in their heads: \"Come to the light... come to the light...\" This is identical to the voice they heard upon first entering the room. Xuu is continuing his efforts to lure them to the pyramid. The voice persists for a minute, then fades.",
                                                "TODO",
                                                "{@b 3 Wight:} AC 5; MV 12; HD 4 +3; hp 25; #AT 1; Dmg 1-4; SA energy drain; SD immune to sleep, charm, hold, and cold-based spells; immune to poison and paralysis attacks; AL LE; THACO 15.",
                                                "{@b 4 Ghouls (1-6):} AC 6; MV 9; HD 2; hp 12 each; #AT 3; Dmg 1.3/1.3/1-6; SA paralysis; SD immune to sleep and charm spells; AL CE; THACO 19.",
                                                "{@b 5 Zombies (1-6):} AC 8; M V 6; HD 2; hp 10 each; #AT 1; Dmg 1-8; SA energy drain; SD immune to sleep, charm, hold, death magic, and cold-based spells; immune to poison; A L N; THACO 19.",
                                                "{@b 6 Skeletons (1-12):} AC 7; MV 12; HD 1; hp 6 each; #AT 1; Dmg 1-6; SA energy drain; SD immune to sleep, charm, fear, hold, and cold-based spells; edged and piercing weapons do half damage; AL N; THACO 19."
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Encounters",
                                    "entries": [
                                        "1. Faces 1 and 2: Aimless Dead. There are many clear areas on these faces of the room, if the PCs wish to land their ship and explore them on foot. The grey ash is only a few inches deep and doesn't impede the PCs' movement. The corpses arranged in the shape of runes are in various states of decomposition; most are humanoid, but a few are unrecognisable alien races. Speak with dead, resurrection, or similar spells have no effect on these corpses.",
                                        "The runes are meaningless to the PCs. Comprehend languages reveals the runes to represent some type of prayer.",
                                        "Hundreds of undead wander aimlessly through the runes. Unless a random encounter is indicated, they ignore the PCs.",
                                        "2. Face 3: Red Spheres. This face is similar to those described in Encounter 1, complete with corpse runes, wandering undead, and grey ash.",
                                        "However, hundreds of six-foot diameter red spheres are nested in the ash, spaced about 100feet apart. These are beholder corpses enclosed in their protective funeral shells. About every fifth shell is chipping and cracking; Xuu hasn't repaired them yet.",
                                        "There are many small pools of thick, red liquid on this face. This is the salve used to cover the beholder corpses and repair their cracked shells. It has no other function. The salve is pasty to the touch and smells like sea water.",
                                        "Assume a 20% chance that any given beholder corpse has a cracked or chipped shell. If a PC comes within ten feet of one of these beholders, it rises from the ground and pursues him. The beholder doesn't attack the PC; it just wants the PC to repair its cracks.",
                                        "TODO",
                                        "Beholder zombie: AC 7; MV FI 3 (B); HD 4; hp 20; #AT 1; Dmg 2-12(chilling touch); AL N;THACO 17.",
                                        "A beholder zombie pursues for 2-12 rounds, after which time it gives up and settles back into the ash (although its eyes are no longer functional, the beholder zombie can sense the presence of the PCs). If the PCs repair its cracked shell (this takes 2-20 rounds), it also settles down.",
                                        "If the PCs attack it, it attempts to bump into them; an active zombie beholder can activate its chilling touch at will, with each touch inflicting 2-12 hp of damage (the victim may save vs. spells for half damage). An attacking zombie beholder continues to attack until it is destroyed or until its victims have fled at least 100 feet. At that point, the zombie beholder becomes inactive again.",
                                        "If the PCs examine a beholder corpse whose shell isn't cracked, the corpse remains inactive. However, if they damage the shell in any way, it becomes a zombie beholder and attacks as described.",
                                        "3. Face 4: Black Doom. Random encounters do not occur on this face of the room.",
                                        "This entire face is a smooth, hard surface with the density of black diamond. The plane is a physical manifestation of the essence of death permeating this room.",
                                        "When a PC is within 100-200 yards of this face, he will begin to feel nauseated and shaky. If he comes within 50-100 yards, he suffers 2-8 hp of damage unless he makes a successful save vs. death magic. Within 10-50 yards, he suffers an additional 3-18 hp of damage (save for half damage). Within 10 feet of it, he must save vs. death magic or die; if the roll succeeds, he suffers an additional 6-36 (6d6) hp of damage. There is nothing of interest on this face.",
                                        "4. Face 5: Muck Pool. Random encounters do not occur on this face of the room.",
                                        "A pool of thick muck resembling grey mud fills this entire wall. The muck is odourless and about 3 feet deep. The PCs can walk through it, though their movement rates are reduced by 75%.",
                                        "The muck actually conceals a patchwork of small conduits leading to another plane of existence. As a PC makes his way through the muck, he has a 25% chance of stepping into a conduit; then he begins to sink as if in quicksand. The PC sinks at a rate of two feet per round. There is a 25% chance that he can clamber out of the conduit himself before he slips away. Otherwise, any PC can pull a sinking PC free of the sucking conduit with a Strength Check at a -2 penalty. Any two PCs working together can pull him out with no problem.",
                                        "If the PC sinks below the surface, he can still be rescued as long as his companions can feel around and find him. However, the PC continues to sink at a rate of two feet per round. If he isn't rescued before he sinks out of reach, he is never seen again.",
                                        "5. Face 6: Red Pyramid. This face is similar to the one in Encounter 1, complete with corpse runes, wandering undead, and grey ash.",
                                        "Centred in the face is a tall, red pyramid. About 200 feet per side at the base, the pyramid is made of red granite blocks and has a single 20-foot square doorway on one side. Do not check for random encounters when the PCs are inside the pyramid.",
                                        "The interior is enchanted with permanent continual light spells that radiate a soft red glow. About 100 red spheres line the walls. Each is about six feet in diameter and is coloured blood-red.",
                                        "These are beholder corpses. About one-fifth of them are cracked and chipped. If the PCs come within 10 feet of a cracked sphere, the corpse becomes an active zombie beholder (see Encounter 2 for details). However, these zombie beholders do not leave the pyramid.",
                                        "There are many small cisterns of thick, red liquid in this room. This is the salve used to cover the beholder corpses and repair their cracked shells (see Encounter 2).",
                                        {
                                            "type": "entries",
                                            "name": "Xuu's Arrival",
                                            "entries": [
                                                "After a PC enters the pyramid and looks around, a blue fog rushes in. A moment later, Xuu appears in the doorway in his wraith form. He looks over the PCs. \"You have come to the light,\" he says. \"You have been chosen for a great honour.\" Xuu explains that the PCs will spend eternity under his command, helping to care for the corpses of a mighty beholder empire. \"You can begin by repairing these.\"",
                                                "If the PCs resist, Xuu warns them to cooperate or join the walking dead roaming the walls of ash. If the PCS continue to resist, the offended Xuu attacks, intending to kill them all for their insolence.",
                                                "Once the fighting begins, a new zombie beholder joins the battle every three rounds thereafter. Though the zombie beholders won't leave the pyramid, Xuu will. He pursues the PCs relentlessly, although he won't leave Room 11.",
                                                "If the PCs cooperate with Xuu, he tells them to scoop up handfuls of the red salve and patch the cracked shells of the beholders. No matter how carefully the PCs do this, Xuu won't be satisfied with their efforts. After a few attempts, Xuu becomes angry. \"You are no better than the zombies!\" Then he attacks as outlined above."
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Troubleshooting",
                                    "entries": [
                                        "{@b PCs are dying like flies:} This is an extremely dangerous room. Use fewer random encounters and reduce the frequency of the zombie beholders. If necessary, give the thick red salve bizarre healing powers when used on living things: but it will not work outside this room.",
                                        "{@b PCs don't investigate the pyramid:} Xuu broadcasts urgent mental messages to them, perhaps along the lines of \"There is little time to waste. and much is at stake!\" The messages become louder and more frequent when the PCs approach Face 6. He's completely shameless."
                                    ]
                                }
                            ]
                        },
                        {
                            "type": "section",
                            "name": "Room 12 - Ritual Gone Wrong",
                            "entries": [
                                "This room, a ceremonial chamber for the Sazaur, holds the Queen's central eye with its antimagic (or, to be precise, its minor globe) power. The room lies beneath the brass dome the PCs saw from space.",
                                "Unlike the previous ten rooms, this description offers clues that tie directly into the story. Though the PCs probably do not discover this until later, this is the domain of the greatest of the Queen's Eyes.",
                                {
                                    "type": "entries",
                                    "name": "Description",
                                    "entries": [
                                        "To get here, PCs probably must pass through the passage from the central chamber. See below for a description of that passage. If they didn't go through it, adjust the following passage accordingly:",
                                        {
                                            "type": "inset",
                                            "name": "Read the following:",
                                            "entries": [
                                                "You're standing on a vast, perfectly flat, open plain. The passage you came through is close at your feet, gaping like a pit. The shining crystal in its centre is the only light in this room. Below the crystal, you see distant brown rectangles, the murals of the central chamber. From here, they look similar to cultivated fields seen from high overhead.",
                                                "The sky is the colour of brass. Why does it look so shiny? Finally you realize that this is the dome you saw from outside the asteroid.",
                                                "The dome is a slightly curved canopy of metal. Its bright reflection of the light below makes it hard to judge distances, but you suppose it can't be more than a mile overhead. But it extends outward to a horizon that must be two or three miles away.",
                                                "On the horizon, the dome meets the floor. The floor is some kind of grey stone. When you look down, you notice peculiar curved channels carved in the floor."
                                            ]
                                        },
                                        "Examination shows that the channels form a strange hierarchy of circles within ever larger circles. For details, see the next subsection.",
                                        "This room is a perfect circle that measures about two and one-quarter miles across. The passage to the central sphere, in the floor in the exact centre of this room, gapes like a pit.",
                                        "The dome is indeed only one mile overhead. A successful Intelligence check lets a PC perceive a very thin line running straight across the middle of the dome, from horizon to horizon. When the Ravager leaves the Hive, the dome opens along this line, and its two halves arc back to allow unobstructed passage.",
                                        {
                                            "type": "entries",
                                            "name": "The Circles",
                                            "entries": [
                                                "This room's arrangement of circles aided the Sazaur's rites that created the Ravager. A similar ritual circle helped them create the Queen's Eyes relics: this ritual is depicted on the murals in the central chamber. This section describes the circles in detail.",
                                                "The 10,000 circles, one for each member of the Sazaur nation, are arranged in a hierarchy of ever-larger circles, as follows. (Note that all measurements are approximate. The Sazaur, predictably, did not use yards and miles.)",
                                                "The smallest circles measure about five feet across, just large enough for one beholder to float in place.",
                                                "Ten of these small circles lie equally spaced five feet apart around the perimeter of a larger, \"second-order\" circle: its perimeter measures about 100 feet, and its diameter about 35 feet.",
                                                "Ten of these second-order circles lie equally spaced about 35 feet apart around the perimeter of a third-order circle, Its perimeter measures almost 700 feet, its diameter around 225 feet. A third-order circle contains 100 small circles.",
                                                "Ten third-order circles lie equally spaced 225 feet apart around the perimeter of a fourth-order circle. It measures almost 4,500 feet around the perimeter (over three-quarters of a mile) and about 1,435 feet across. This fourth-order circle contains 1,000 small circles.",
                                                "Finally, each of ten fourth-order circles is spaced equally around the room's central pit. Spaced 1,435 feet apart, they make a perimeter of 28,700 feet (5.4 miles) and a diameter for the pit of 9,140 feet (1.7 miles).",
                                                "{@b A clue among the circles:} Though this room offers no action or opponents, one object among the circles can provide clues to the origin and methods of the Ravager.",
                                                "Amid the flat expanse of circles, the item stands out prominently. However, there is so much room here that PCs must actively search in order to avoid overlooking the clue: a partly disintegrated stone beholder!",
                                                "Only part of the central sphere and a few eyestalks remain of this Sazaur. Around its fragmentary body are scatterings of fine, grey dust. Close examination of the other circles reveals a film of grey dust in each of them. The silver slimes refuse to eat or clean up this dust.",
                                                "This beholder indicates the fate of the entire Sazaur nation. In this room, the Ravager, once assembled for the first time, turned all the beholders to stone, telekinesed them into its interior, and disintegrated them. Then, having sucked out their life forces to power the Queen's Eyes, the Ravager spewed out the dust of its creators.",
                                                "This single beholder managed to escape that first wave of death, but all it accomplished was to meet its end outside the Ravager, rather than inside with the rest of its nation.",
                                                "The dust does not detect as magical, and it is not useful to the PCs.",
                                                "The DM can also introduce other clues in this room, including clues to the contents of the other rooms."
                                            ]
                                        },
                                        {
                                            "type": "entries",
                                            "name": "The Passage",
                                            "entries": [
                                                "The passage to the central chamber, 1.7 miles wide, is a mere 500 feet long. Otherwise, it resembles the tunnel passages between the central sphere and the smaller rooms (see 'the tunnel description at the beginning of this chapter).",
                                                "Gravity works to hold any foot traveller to the side of the passage, no matter what his orientation. The black basalt is carved with the same mystical gravity-creating symbols as the other tunnels. However, spelljamming ships can sail through the passage as though through empty space... or they could, if it weren't for the giant crystal that neutralizes all magical helms."
                                            ]
                                        },
                                        {
                                            "type": "entries",
                                            "name": "The Giant Crystal",
                                            "entries": [
                                                "Illuminating both this room and the central chamber, this giant crystal floats in the centre of the passage between them. It is 100 yards in diameter and reaches within 100 feet of either end of the passage. However, it is small compared to the passage's diameter, much like the eye's pupil in its iris. (Emphasize the large-scale resemblance to a beholder's eye in order to spook the players.)",
                                                "{@b Appearance:} The crystal glows white, as brightly as a powerful lighthouse flame. Staring at the crystal results in blindness for 1d4 turns. If the PCs want to examine the crystal, they must use magic or cleverness to avoid being blinded.",
                                                "The crystal's facets are carved with strange symbols, the same power symbols used in the central chamber's murals (see the description of Room 1).",
                                                "{@b Inner chamber:} One of the power symbols conceals a hidden entryway leading inside the crystal. It is so well concealed that the PCs cannot discover this except in truly extraordinary circumstances. Jon Tobart has learned of the entryway and the inner chamber in his studies. He enters the crystal in the next chapter.",
                                                "The angular, 60-yard entryway leads to the centre of the crystal, where the Arcane hollowed out a 30' long, decahedral room. Its walls are polished to a mirror finish. In the centre of this chamber rests the central, the largest, the primary Queen's Eye relic, the antimagic ray eye of the Sazaur Queen."
                                            ]
                                        },
                                        {
                                            "type": "entries",
                                            "name": "The Queen's Eye",
                                            "entries": [
                                                "For a description of the eye, see the New Magic appendix.",
                                                "Why is this eye inside the crystal? For one reason, it directly receives the energies that the Ravager transmits into the crystal. But the main reason is security. The Sazaur beholders could reach it, since the ray does not neutralize a beholder's levitation power: but few others could bridge the mile-wide gap from the passage \"floor\" to the crystal.",
                                                "Though PCs may want to try this, it should be practically impossible for 6-8th level characters. Low-level magic attempted in the light of the crystal is neutralized, as though by a minor globe of invulnerability. Only a six-inch thickness of lead or a greater thickness of stone stops the ray's effect.",
                                                "Resourceful PCs could stretch their ship's infinite rope across the passage, then climb to the centre from one side. This necessitates a one-mile climb as difficult as the one in Chapter 1. Other approaches are possible: reward cleverness with information, without actually letting the PCs into the crystal. That comes later."
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "type": "entries",
                                    "name": "Troubleshooting",
                                    "entries": [
                                        "{@b PCs find their way into the crystal:} Something has gone terribly wrong. But the situation is not hopeless: assume that Jon Tobart/Shazogrox has already made his way inside. He is waiting there, already in his Sentinel suit and armed with the Queen's Eye relic.",
                                        "Tobart probably repels the PCs easily: if so, he immediately forms the Ravager as described in the next chapter. If the PCs manage to fight, go to Chapter 6 to stage the final battle with Tobart."
                                    ]
                                }
                            ]
                        }